#ifndef NANA_DETAIL_KEYBOARD_INPUT_METHOD_INCLUDED
#define NANA_DETAIL_KEYBOARD_INPUT_METHOD_INCLUDED

#include <string>
#include <vector>
#include <map>
#include <set>
#include <iterator>

namespace nana::detail
{
	/// Input method interface
	class im_interface
	{
	public:
		enum class labels
		{
			name,
			short_name,
			alphabet,
			space,
			done
		};

		virtual ~im_interface() = default;

		/// Test if candidate is empty
		virtual bool has_intermediate_input() const = 0;
		virtual std::wstring label(labels) const = 0;
		virtual std::string lang() const = 0;

		/// Returns the new input content with a new input character
		virtual std::wstring input(std::size_t pos, wchar_t) = 0;
		virtual std::vector<std::wstring> candidates() const = 0;

		/// Selects a candidate and returns the new content
		/**
		 * New input content is made of 2 parts: selected candidate text and the text which to be selected(e.g. Chinese Pinyin)
		 * */
		virtual std::wstring pick_candidate(std::size_t idx) = 0;

		virtual std::wstring letters(bool lower) const = 0;
		virtual std::wstring digital_symbols(bool digital) const = 0;

		/// Returns the keyboard layout for the language
		virtual std::vector<int> layout(bool letter) const = 0;
	};

	class im_english :
		public im_interface
	{
		bool has_intermediate_input() const override
		{
			return false;
		}

		std::wstring label(labels l) const override
		{
			switch (l)
			{
			case labels::name:
			case labels::short_name:
				return L"EN";
			case labels::alphabet:
				return L"ABC";
			case labels::space:
				return L"Space";
			case labels::done:
				return L"Done";
			}
			return {};
		}

		std::string lang() const
		{
			return "en";
		}

		std::wstring input(std::size_t, wchar_t ch) override
		{
			return { &ch, 1 };
		}

		std::vector<std::wstring> candidates() const override
		{
			return {};
		}

		std::wstring pick_candidate(std::size_t) override
		{
			return {};
		}

		std::wstring letters(bool lower) const override
		{
			return lower ? L"qwertyuiopasdfghjklzxcvbnm" : L"QWERTYUIOPASDFGHJKLZXCVBNM";
		}

		std::wstring digital_symbols(bool digital) const override
		{
			return digital ? L"-/:;()$&@\".,?!|'" : L"[]{}#%^*+=_—\\|~<>€￡￥·.,?!'";
		}

		std::vector<int> layout(bool /*letter*/) const override
		{
			//Keyboard layout for English is 26 keys
			return std::vector<int>{10, 9, 7};
		}
	};

	class im_russian :
		public im_interface
	{
		bool has_intermediate_input() const override
		{
			return false;
		}

		std::wstring label(labels l) const override
		{
			switch (l)
			{
			case labels::name:
			case labels::short_name:
				return L"RU";
			case labels::alphabet:
				return L"АБВ";
			case labels::space:
				return L"Пробел";
			case labels::done:
				return L"готово";
			}
			return {};
		}

		std::string lang() const
		{
			return "ru";
		}

		std::wstring input(std::size_t, wchar_t ch) override
		{
			return { &ch, 1 };
		}

		std::vector<std::wstring> candidates() const override
		{
			return {};
		}

		std::wstring pick_candidate(std::size_t /*idx*/) override
		{
			return {};
		}

		std::wstring letters(bool lower) const noexcept
		{
			return lower ? L"йцукенгшщзхъфывапролджэёячсмитьбю" : L"ЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЁЯЧСМИТЬБЮ";
		}

		std::wstring digital_symbols(bool digital) const override
		{
			return digital ? L"-/:;()₽&@\".,?!|'" : L"[]{}#%^*+=_—\\|~<>$€￡·.,?!'";
		}

		std::vector<int> layout(bool letter) const override
		{
			//Keyboard layout for Russian characters is 33 keys
			if (letter)
				return std::vector<int>{12, 12, 9};

			return std::vector<int>{10, 9, 7};
		}
	};


	class pinyin
	{
	public:

		struct candidate
		{
			std::size_t count;	///< The number of Pinyins which are associated with the selected candidate.
			std::wstring text;  ///< Text which is selected
			std::wstring pinyin;
		};

		pinyin()
		{
			auto& table = table_;
			table[L"a"] = L"吖阿啊锕嗄錒";
			table[L"ai"] = L"艾伌毐哎哀昹挨埃砹娭爱唉欬捱娾欸啀皑硋硙焥堨溾絠隘凒隑溰嵦嫒塧矮愛碍嗌嗳锿蔼叆瑷暧嘊敳敱僾磑躷皚諰鴱壒濭嬡懓噯薆曖璦懝賹餲癌鎄瞹馤皧譪霭礙藹譺鑀靄靉";
			table[L"an"] = L"厂广厈屵犴安屽岸侒荌垵洝按玵峖咹案氨胺豻桉俺隌唵庵铵偣埯堓菴谙啽媕晻萻葊揞暗腤雸痷鹌裺誝銨貋罯蓭鞍鞌儑諳錌盦闇馣鮟盫鵪鶕韽黯";
			table[L"ang"] = L"卬仰岇枊昂肮昻盎骯醠";
			table[L"ao"] = L"艹凹芺扷抝岙坳垇泑拗柪袄岰郩敖眑梎镺媪隞厫傲軪奥奡滶慠蔜遨骜奧廒嶅嗷嗸獓嫯媼隩熬璈摮獒磝墺熝懊嶴澳擙翱聱螯墽襖翶謷謸翺鏊鳌爊鏖鏕驁鷔鰲鼇";
			table[L"ba"] = L"八丷仈巴犮叭扒叐朳玐把伯坝抜扷芭吧岜弝夿妭拔茇爸皅癹钯胈疤柭炦峇羓笆粑耙蚆罢釟哱哵捌垻菝跁豝跋鈀鲃軷詙鲅鲌靶魞颰魃罷鮊鮁鼥覇矲霸灞壩欛";
			table[L"bai"] = L"白百庍呗伯佰拝败挀拜柏栢瓸唄敗捭猈竡掰粨絔摆稗粺薭擘擺贁韛犤襬";
			table[L"ban"] = L"办半阪伴扳岅扮坂朌肦瓪昄攽版板怑坢绊姅拌柈钣班颁秚舨粄般湴絆斑鈑跘斒搬頒鉡蝂靽搫螁魬鳻瘢辦褩螌闆癍辬瓣";
			table[L"bang"] = L"邦玤帮垹绑挷蚌蚄梆旁浜捠邫棓硥傍谤棒幇綁彭搒蒡塝蛖稖蜯榜膀牓幚磅镑縍艕幫謗鎊鞤髈";
			table[L"bao"] = L"勹勽包犳刨佨报怉孢抱饱宝苞鸨胞枹炮保窇铇豹宲珤趵剝剥袌笣蚫菢堢報葆媬堡煲龅鉋飽寚飹鲍雹骲駂褓鳵裦髱鴇蕔褒緥暴賲虣薄襃鮑闁儤曓嚗瀑寳曝犦爆寶忁齙鑤靌";
			table[L"bei"] = L"贝北陂孛狈呗貝邶牬昁杮卑苝杯备柸盃勃郥背钡悖俻狽唄被倍鄁庳桮梖珼偹偝惫琲軰椑揹僃備悲辈焙棓棑愂鉳鹎碑碚蓓蛽禙骳鞁褙誖箄犕輩諀鋇糒憊臂鞞藣鞴鵯鐾";
			table[L"ben"] = L"本夯夲体坋坌炃泍苯奔倴奙畚栟捹笨翉桳逩渀喯犇賁楍锛漰撪錛蟦";
			table[L"beng"] = L"祊迸泵甭甮埄蚌崩绷堋埲奟逬菶揼絣琫琣閍跰痭嵭嗙塴嘣綳甏镚繃鞛蹦鏰";
			table[L"bi"] = L"匕币比必夶闭闬毕朼邲佊佛佖诐芘迊庇吡妣沘纰坒皀疕苾彼咇妼屄拂泌怭怶毞肶畀畁陛荜哔贲毖柲柀祕珌胇秕疪畐俾荸娝狴毙笔秘铋畢袐粃粊紕舭笓偪萆萞啚婢崥旇梐敝紴翍閉閈閇逼弼弻湢堛愊愎赑毴禆皕筆筚賁貱詖鼻鄙敝痹蓖弊碧薜避廦嬖壁螕縪篦蔽斃臂蹕鲾鞞髀璧";
			table[L"bian"] = L"卞弁辺边苄釆忭汴汳抃贬变炞玣峅変扁昪疺砭窆便覍匾笾貶猵遍惼徧萹揙编缏甂閞牑煸稨碥辡褊箯糄蝙艑鴘鞕辨辩辧辫鞭";
			table[L"biao"] = L"灬杓表骉标飑俵髟婊彪淲颩脿猋僄裱嫑墂幖颮骠蔈摽滮標麃熛膘膔飚飙镖錶瘭磦褾颷儦";
			table[L"bie"] = L"别別柲柭莂蛂徶彆憋瘪襒蟞蹩癟鳖鱉鼈虌龞";
			table[L"bin"] = { L"汃邠玢砏宾彬梹傧斌椕频缤摈滨賓賔膑豩瑸槟髩殡镔頻濒儐豳鬂虨" };
			table[L"bing"] = { L"冫仌仒丙氷冰并兵邴陃並枋怲抦秉幷苪併庰屏饼昺垪炳柄昞竝眪病窉栟栤倂梹蛃掤偋屛棅絣傡琕摒寎稟禀誁鈵鉼鞆餅槟鋲餠鞞鮩檳鞸靐" };
			table[L"bo"] = { L"卜仢癶彴伯佛驳肑苩帛狛拨波泊瓝郣勃侼柏柭玻胉剥剝亳哱饽挬浡瓟秡钵钹铂盋砵袯趵菠萡啵淿桲脖袹蚾缽紴舶博葧渤溊殕鹁跛猼馎搏愽碆鉢鈸鉑鲌僰僠蔔澚煿榑牔膊艊箔誖馛駁噃嶓播撥镈踣鋍餑薄擗壆孹馞駮鮊檗檘擘穛磻襏謈嚗懪礡簙鎛餺鵓糪簸簿譒蹳髆髉蘗欂皪襮礴驋鱍鑮" };
			table[L"bu"] = { L"卜不卟布步吥佈补歩歨咘怖抪钚巭柨悑钸埗埔捕峬哺捗部庯逋勏荹捬埠婄晡補鈈瓿堡廍鳪鈽蔀踄誧箁郶餔篰錻餢鵏鯆醭轐簿鸔" };

			table[L"ca"] = { L"拆遪嚓擦攃礤囃礸" };
			table[L"cai"] = { L"才扐材财采財倸宷彩埰採猜婇寀啋菜偲裁棌揌睬跴綵蔡踩縩纔" };
			table[L"can"] = { L"灿参残蚕參叄飡惨骖惭掺殘孱朁湌喰叅粲傪摲摻蝅慚慘嘇憯慙澯穇嬠薒餐燦璨篸謲鏒黪驂囋黲蠶蠺" };
			table[L"cang"] = { L"仓仺伧沧苍玱匨鸧倉舱傖凔蒼獊嵢滄瑲臧螥艙篬藏賶鶬鑶" };
			table[L"cao"] = { L"屮艸肏草曺曹愺慅傮漕嶆慒嘈蓸撡鄵槽糙懆褿操螬艚襙鏪騲鼜" };
			table[L"ce"] = { L"夨冊册厕侧栅恻测拺荝畟敇笧粣萗側厠策測惻廁萴蓛筴筞箣憡簎" };
			table[L"cen"] = L"岑汵参涔埁笒參叄叅嵾穇篸";
			table[L"ceng"] = { L"层曽曾噌嶒層橧竲蹭驓" };
			table[L"cha"] = { L"叉仛奼汊扠扱芆杈岔苴侘衩刹诧紁剎垞查査茬秅茶差姹臿挿捈梌偛靫猹喳嵖馇插揷搽楂詧詫槎碴摖察锸銟艖疀蹅嚓鍤鎈餷檫镲鑔" };
			table[L"chai"] = { L"芆犲肞侪拆钗差虿袃豺訍柴茝祡釵喍瘥儕蠆囆" };
			table[L"chan"] = { L"产辿忏刬苂旵丳单斺浐觇剗谄梴谗啴阐婵崭掺铲產産硟蒇單馋搀湹孱棎禅覘剷缠煘裧僝獑嶄嶃摻摲摌滻蝉緂誗鋋儃蕆廛幝嘽骣嬋潺潹緾諂鋓閳幨澶燀禪磛鄽毚螹簅冁瀍懴襜蟬繟醦劖酁儳蟾繵譂鏟颤嚵巉攙瀺壥懺闡欃纏羼囅镵纒躔韂顫灛艬讇讒鑱饞" };
			table[L"chang"] = { L"厂长仧仩伥场兏镸肠玚怅苌昌長畅昶尝倡倘鬯倀菖瓺悵惝偿淐淌猖娼阊唱常萇徜場焻琩敞腸甞瑒锠裮厰裳畼暢塲僘嫦嘗瑺廠誯膓鋹鲳閶錩氅嚐鲿韔償闛鯧鼚鱨" };
			table[L"chao"] = { L"仦仯吵抄弨炒怊钞欩牊耖粆眧晁绰觘訬巣巢鈔焣焯超朝鼌剿鄛勦禉漅煼綽摷麨劋窲樔槱潮嘲窼罺鼂轈謿巐" };
			table[L"che"] = { L"屮车尺伡彻車扯迠呫坼俥砗偖唓莗烢聅烲焎掣硨硩揊蛼頙撦摰澈撤徹瞮勶爡奲" };
			table[L"chen"] = { L"伧臣尘陈肜沉沈辰忱抻迧衬茞疢爯烥栕称郴宸陳龀莐莀晨捵敐偁桭梣谌趻軙訦硶跈鈂趂趁琛傖棽愖蔯嗔榇碜煁敶墋塵綝樄瘎稱瘨夦瞋賝霃諃齓踸諶螴磣鍖齔薼謓醦儭麎贂谶曟嚫穪櫬襯鷐讖" };
			table[L"cheng"] = { L"氶丞成朾阷呈抢净郕诚泟枨承乗侱荿宬娍峸洆城埩柽爯乘凈徎逞骋挰浧浾埕悜棦晟琤珹称秤偁庱掁淨珵脭铛铖盛碀窚蛏揨堘椉棖晿惩牚程睈裎絾筬搶溗塍塖赪誠僜摚憆稱畻酲鋮靗撑撐撜澄澂憕緽橙橕橖檙瞠赬頳檉竀騁鯎瀓罉鎗懲穪矃蟶鏿鐣饓騬" };
			table[L"chi"] = { L"彳尺叱叺斥伬弛吃驰扡池佁迟呎妛饬灻杘肔赤卶侈侙茌迡狋抶沶坻齿勅荎奓持拸垑恜炽柅胣竾勑俿哧彨捇恥胵歭眙鸱蚩蚇耻翅翄匙菭烾敕瓻眵袳蚳耛粚笞豉赿遅啻喫湁欼歯筂貾訵飭袲傺遟嗤媸摛腟痴痸裭絺誃跢鉓雴馳遫憏樆瘈翤箎箈銐鉹徲遲噄墀殦漦慗慸瞝瘛褫翨誺踟齒噭熾螭篪鴟謘鍉鵄邌懘趩癡魑鶗鶒鶙齝攡麶彲鷘黐" };
			table[L"chong"] = { L"虫充冲忡沖宠茺重涌珫翀浺埫崈崇铳痋舂隀揰摏漴銃嘃褈衝緟蝩憃憧徸罿蟲艟蹖寵爞" };
			table[L"chou"] = { L"丒丑仇吜杽杻怞抽俦牰诪帱栦臭绸梼偢紬惆畤掫菗婤遚絒畴臰椆愁稠裯筹詶酬酧皗搊瞅跾踌綢殠醜篘儔醔瘳雔鮘嚋薵幬盩懤嬦雠燽檮矁疇籌犨醻躊讐讎魗雦犫" };
			table[L"chu"] = { L"亍刍处出処岀助初竌豖绌泏怵杵竐欪炪除础敊畜芻俶絀耝珿椘處埱菆鄐厨豠禇楮锄蒢傗储滁蒭蜍耡触雏趎滀鉏慉搐媰楚榋摢閦犓摴樗廚嘼諔鋤篨儊濋憷橱橻檚黜儲臅璴歜斶礎雛藸貙幮躇蟵櫉蹰櫥櫖觸齣鶵躕齭矗齼" };
			table[L"chua"] = { L"欻" };
			table[L"chuai"] = { L"啜揣欼搋膗膪踹" };
			table[L"chuan"] = { L"巛川传汌舛串玔氚钏荈舡穿舩剶釧船遄喘圌猭堾椽傳瑏歂椯僢賗膞暷篅輲踳鶨" };
			table[L"chuang"] = { L"刅创闯怆床刱牀剏疮剙窓喠窗創傸愴牎摐幢瘡牕噇朣磢橦窻闖" };
			table[L"chui"] = { L"吹炊垂倕桘埀陲捶惙菙圌棰椎搥腄槌硾锤箠錘鎚顀龡" };
			table[L"chun"] = { L"芚纯肫旾杶陙朐春莼純唇浱偆脣萅淳湻萶犉媋暙鹑蒓惷瑃槆椿滣蓴漘睶膞箺醇蝽賰輴橁醕錞櫄鶉鯙鶞鰆蠢" };
			table[L"chuo"] = { L"辶辵吷拺哾娖娕逴惙绰涰淖婥婼啜辍酫踀綽鋜趠輟箹踔龊磭餟擉戳繛歠鏃嚽齪鑡孎" };
			table[L"ci"] = { L"朿次此伺词刾珁刺佽佌茨茦差庛呲呰祠泚兹垐柌瓷栨玼趀疵莿皉赐粢蛓絘辝偨詞啙慈辞甆跐雌磁鹚螆糍" };
			table[L"cong"] = { L"从匆丛苁囪囱枞忩茐怱徔従從徖悤婃淙孮悰琮棇焧愡葱楤碂蔥慒憁漗漎聡潈潀骢蓯熜璁賩賨聦聪瑽暰誴樬樅潨樷瞛錝藂鍯篵聰蟌繱叢謥鏦鏓騘灇驄欉爜" };
			table[L"cou"] = { L"凑湊傶辏楱腠輳" };
			table[L"cu"] = { L"卒徂怚促殂觕粗脨猝媨趋麁瘄趗誎蔟噈醋憱趣踧麄皻瘯麆踿橻鼀縬趨簇蹙蹵蹴顣麤" };
			table[L"cuan"] = { L"汆窜撺鋑篡殩熶窽簒窾镩濽竄攒櫕蹿攛灒攢巑欑穳躥鑹爨" };
			table[L"cui"] = { L"伜忰隹乼疩粋脆脃翆紣倅崒崔淬啛啐萃悴脺焠琗毳椊瘁凗缞嵟催榱翠慛墔漼綷摧粹趡槯膵璀熣磪皠膬縗竁襊濢顇臎鏙" };
			table[L"cun"] = { L"寸刌邨吋忖存村侟拵籿皴澊竴膥" };
			table[L"cuo"] = { L"剉剒莝莡厝夎挫庴脞措逪虘嵯嵳痤搓睉矬蒫锉瑳错遳蓌瘥磋蔖撮縒諎銼鹾醝蹉錯鎈鹺" };

			table[L"da"] = { L"大亣打达迏迖迚怛沓妲呾咑耷哒荅荙羍炟畗眔笪笚畣匒惮剳逹溚搭嗒達詚答跶瘩靼褡薘鞑墶噠撘憚鎝蟽鎉鐽韃龖龘" };
			table[L"dai"] = { L"大歹歺代轪诒呔呆侢垈绐岱帒迨甙隶柋殆怠毒玳贷带待軑帯貣埭袋釱軚紿蚮逮帶傣軩貸棣瑇跢箉獃廗緿蝳曃叇駘鴏隷艜懛黛隸戴蹛簤瀻霴襶黱靆" };
			table[L"dan"] = { L"丹旦石刐伔但帎妉抌单诞呾狚担泹沊瓭玬単唌柦胆眈砃衴郸疸疍耽耼紞訑萏弹啖啗掸淡惮惔蛋聃躭酖弾單啿媅愖赕殚氮腅蜑觛亶蓞瘅窞誕匰鄲僤噉褝箪頕髧馾勯儋彈嘾撣撢憚賧醈擔澹憺殫燀禫餤駳鴠黕甔膻膽癉襌癚皽簞嚪聸繵贉饏霮黮黵" };
			table[L"dang"] = { L"氹凼圵当砀宕垱荡挡档党珰铛裆菪偒婸崵逿瓽筜谠愓嵣雼當碭潒趤蕩瞊儅壋澢擋噹璗檔盪璫簜礑襠蟷艡簹譡蘯黨鐺闣灙攩欓讜" };
			table[L"dao"] = { L"刂刀辺忉叨氘朷导岛到舠陦捣釖鱽島倒帱盗祷捯梼菿悼焘盜絩道禂裯隝搗魛翢稲箌嶌嶋嘄艔噵導稻衜衟螩檤隯蹈壔擣嶹幬禱檮燾翿軇瓙纛" };
			table[L"de"] = { L"地旳底的恴得蚮淂脦棏惪悳锝徳嘚德鍀" };
			table[L"den"] = { L"扥扽" };
			table[L"dei"] = { L"得嘚" };
			table[L"deng"] = { L"邓灯登等戥豋鄧僜凳隥嶝澄嬁墱憕噔燈璒镫竳瞪磴艠櫈簦瀓覴蹬鐙" };
			table[L"di"] = { L"氐仾扚地厎邸阺低诋廸弟狄坘坔杕旳玓肑苐苖彽迪奃弤底呧岻抵拞坻怟枑枤的籴俤帝哋埅柢牴荻递逓唙娣涤浟埊敌秪砥袛隄偙谛菂菧啇啲掋埞焍梊梑祶珶眱笛第釱羝蒂遆媂提揥渧缔堤觌棣睇軧觝詆趆靮僀蓧遞滌楴禘腣鉪髢馰蔕蔋蔐遰嘀嫡嵽摕滴墬墆墑碲碮疐蝃聜翟骶頔樀敵甋慸蝭締嶳镝篴諦諟踶藡嚁磾螮豴蹢鞮鏑糴覿鸐" };
			table[L"dia"] = { L"嗲" };
			table[L"dian"] = { L"电阽佃佔甸坫典店奌玷敁扂点垫钿痁婝婰掂淀惦琔敟厧傎奠跕電碘痶蒧殿嵮鈿滇蜔槙槇墊窴蕇踮瘨靛颠橝橂壂澱點磹蹎癜簟顚顛巅嚸癫巓攧驔巔癲齻" };
			table[L"diao"] = { L"刁弔汈叼伄吊扚刟虭钓盄屌訋凋窎调蛁掉彫铞铫弴奝釣鳥絩琱貂鈟椆誂碉鳭竨蓧魡銱銚雿調鲷鮉雕窵錭鋽瞗瘹藋鼦鵰鯛鑃" };
			table[L"die"] = { L"佚怢苵迭泆恎垤咥哋胅昳峌柣挕绖爹耊瓞眣戜眰谍啑镻畳絰幉臷喋崼跌軼詄跕趃耋揲堞惵跮牒叠殜牃楪褋蜨嵽碟蝶艓槢疂蹀諜鴩褺螲鲽鞢曡鰈疉疊氎" };
			table[L"ding"] = { L"丁仃订艼帄叮奵饤忊玎盯甼町矴疔钉虰顶耵定訂酊飣釘铤掟啶頂靪萣鼎椗腚锭碇鋌碠嵿鼑薡濎錠磸顁鐤" };
			table[L"diu"] = { L"丢丟铥颩銩" };
			table[L"dong"] = { L"冬东动冻岽東咚苳侗挏栋氡恫垌洞昸峒狪胨姛迵胴倲凍烔戙鸫涷埬硐笗動崠崬菄娻氭腖揰棟絧湩董働勭蝀墥箽諌懂嬞蕫燑駧鮗霘鼕鶇鯟鶫" };
			table[L"dou"] = { L"斗乧阧吋豆抖吺枓侸剅钭郖陡读鬥浢饾狵唞唗都逗蚪荳酘脰渎梪毭兜痘兠鈄閗窦鬦蔸餖鋀橷瞗斣篼闘瀆竇鬪鬬鬭" };
			table[L"du"] = { L"厾芏杜肚妒竺妬笃独毒度姤剢荰读都阇秺渎堵琽暏晵牍椟犊靯赌渡嘟睹督裻読镀賭覩醏獨螙錖篤闍凟殬斁鍍匵嬻瀆瓄牘犢櫝殰黩騳皾豄蠧讀贕韣髑鑟韇韥蠹黷讟" };
			table[L"duan"] = { L"耑段偳断剬葮媏缎塅短腶瑖椴煅锻端碫褍緞毈簖鍛鍴斷躖籪" };
			table[L"dui"] = { L"队对兊兌兑対杸祋追怼垖陮啍敓敚堆隊塠敦碓綐痽磓對憞頧憝鴭镦濻濧薱懟瀢瀩譈鐜鐓轛譵" };
			table[L"dun"] = { L"伅庉吨沌坉忳囤炖逇砘盾盹钝顿趸惇遁鈍敦頓楯遯蜳碷壿墪撴潡墫憞墩撉噸犜橔燉踲礅蹲蹾躉驐" };
			table[L"duo"] = { L"仛朶朵夛多夺杝杕剁枤沰沲饳咄刴陏陊度垜垛柁挆挅柂柮尮哚哆剟铎桗剫隋缍堕埵舵掇袳崜敚敓鈬敠敪痥惰媠隓喥毲跢跥跺趓椯馱飿躱硾躲裰憜綞奪駄墮墯凙亸踱隳嚉軃鬌鵽嚲鐸奲" };
			table[L"e"] = { L"厄戹阨讹岋阸苊迗吪呃扼囮呝妸妿轭枙砐俄咹咢姶峉洝垩砈匎莪哦娿婀娥峨峩屙饿涐敋恶砨蚅鄂卾偔谔阏娾堊珴悪硆軛訛萼遌遏崿湂堨堮愕惡皒锇睋痾鹅軶豟鈋鈪廅搕搤搹腭痷琧蛾頋僫锷鹗磀蝁誐蕚遻噁鋨餓頞頟魤颚额噩擜覨諤閼餩鍔鳄騀鵈歞顎額鵝鵞礘譌櫮鶚鰐鰪讍齃鑩齶鱷" };
			table[L"ei"] = { L"诶欸誒" };
			table[L"en"] = { L"奀峎恩蒽摁嗯煾" };
			table[L"eng"] = { L"鞥" };
			table[L"er"] = { L"儿二尔尒尓弍耳弐而児杒侕迩佴陑兒刵贰乻洱洏饵峏咡耏荋胹珥栮栭毦梕貮袻鸸唲铒衈貳粫聏輀誀鉺爾鲕餌隭樲髵髶駬邇鴯鮞薾轜趰" };
			table[L"fa"] = { L"乏发伐冹姂佱法沷坺罚茷疺発阀峜珐垡砝栰笩琺發筏傠彂髪瞂閥罰髮墢罸蕟醗橃藅醱灋" };
			table[L"fan"] = { L"凡凣凢反犯払氾奿帆汎忛仮泛饭犿匥杋返籵柉贩范拚钒矾畈舤訉烦軓舧盕販笵桳笲釩畨梵婏軬棥飰番飯煩緐滼勫範幡噃蕃嬎嬏墦樊憣膰璠橎旙燔薠襎繁輽藩羳翻繙旛轓蹯颿蘩礬鐇瀿瀪籓飜蠜鷭鱕" };
			table[L"fang"] = { L"匚方邡访仿防芳彷妨汸纺坊肪瓬祊昘昉放枋房牥埅钫眆蚄舫紡眪倣淓旊訪趽鈁鲂髣鴋魴鶭" };
			table[L"fei"] = { L"飞妃犻吠芾狒沸胏肺肥非柹废杮胐费昲飛朏胇砩疿剕匪陫俷诽厞屝婔菲萉奜笰淝渄绯悱啡婓斐腓扉暃棐猆靟費廃痱裶镄蜚蜰緋翡榧蕜廢誹橨篚橃霏鲱曊餥鼣馡癈濷蟦騑騛鯡櫠鐨靅飝" };
			table[L"fen"] = { L"分份坆芬纷汾弅帉岎妢坟坋吩氛玢炃枌朌昐忿奋衯砏秎竕翂蚡粉紛羒棻梤酚偾訜粪焚鈖棼雰愤蒶馚僨隫蕡墳魵濆瞓獖幩憤鳻橨奮黺餴朆膹豮燌燓鲼糞鼢鼖羵轒豶瀵鐼饙馩鱝黂" };
			table[L"feng"] = { L"凤风丰冯凨仹讽夆沨沣妦凬枫奉炐凮砜風疯封盽浲埄峯峰覂俸逢莑唪烽偑桻琒焨崶锋堼堸溄湗渢猦葑馮蜂綘赗艂鳯犎楓煈缝漨摓熢瘋鳳碸鴌鄷僼鋒篈賵諷縫檒豐鎽鏠酆蘴寷灃蠭靊飌麷" };
			table[L"fo"] = { L"仏仸佛坲" };
			table[L"fou"] = { L"不缶否妚炰缻缹紑殕雬鴀" };
			table[L"fu"] = { L"乀阝讣夫巿父付弗払邞凫伕伏妇负甶刜附佛芾芙芣呋呒妋扶抚抙孚甫苻茀彿弣府帗咈咐驸宓姇岪拂拊泭绂绋坿怫斧枎玞肤服竎阜鳬郛郙俘俛俌茯荂峊洑垘复炥枹柎柭柫氟祓祔玸韨怤胕砆罘畐畉衭負訃赴俯莩荴尃哹娐捊浮垺栿砩畗袚袝蚨蚥釜釡匐副冨偩菔婦婏捬涪辅旉烰桴琈脯袱蚹虙艴紱紼紨翇符笰麸酜趺傅葍萯復幅富媍赋焤棴椨腑稃秿盙罦蛗絥覄詂跗鈇鄜滏缚辐椱福腹蜉蜅綍綒艀筟鉘鉜鲋颫鳧蓲孵赙榑禣稪複褔粰腐箙箁輔豧颰韍蕧幞嘸撫澓敷膚蝠蝮蝜緮賦頫髴駙麩鳺鴔嬔糐縛輹輻諨踾麬鮄鮒癁襆賻鍑鍢鳆鬴黻簠覆馥麱璷懯襥鵩黼纀鶝鰒" };

			table[L"ga"] = { L"尕玍夹钆旮伽夾尬咖軋尜釓朒魀嘎嘠噶錷" };
			table[L"gai"] = { L"乢丐匃匄忋改杚芥侅陔该郂荄姟峐钙垓晐赅盖祴硙畡絠絯鈣溉摡葢隑槩概戤蓋賅賌豥該漑槪磑瓂" };
			table[L"gan"] = { L"干仠甘忓芉迀玕杆肝汵攼佄旰姏咁苷泔皯矸绀坩盰秆衦柑玵竿酐赶疳倝凎粓紺桿淦乾敢稈詌骭凲筸幹感尲尴榦鳱漧趕澉橄擀篢澸檊尶尷簳魐贑鳡赣贛鱤灨" };
			table[L"gang"] = { L"冈冮刚扛犺岗肛纲杠矼岡疘牨缸钢罡剛堈釭掆崗焹棡港犅焵筻碙摃堽綱槓罁鋼鎠戅戆戇" };
			table[L"gao"] = { L"夰告杲勂诰郜羙高皋祮羔峼菒髙皐祰锆臯稁搞筶睪缟禞膏槀槔睾誥槁鋯槹稿稾镐獋糕篙縞橰藁檺藳鎬餻韟櫜鷎鼛鷱" };
			table[L"ge"] = { L"个戈仡圪纥扢犵合各肐戓吤呄匌牫疙佮佫茖紇阁咯虼革挌哥個鬲格胳敋哿盖铬袼鸽硌笴舸裓蛤蛒臵颌割隔葛嘅愅猲搁觡蓋鲄彁嗝嗰滆滒塥歌膈閣閤鉻搿箇槅戨镉獦鞈韐骼輵諽鴚臈擱鮯鮥鴿謌韚櫊鎶鎑鎘鞷騔轕" };
			table[L"gei"] = { L"给給" };
			table[L"gen"] = { L"亘亙艮茛哏根揯搄跟" };
			table[L"geng"] = { L"更庚刯郠畊莄耕哽峺挭浭绠埂耿颈梗菮椩焿赓堩絚絙鹒綆縆緪賡鲠羮骾鯁鶊羹" };
			table[L"gong"] = { L"工弓廾公厷功共巩红攻杛贡汞糿糼肱侊供紅宫拱羾蚣珙拲貢躬栱恭宮唝龚匑愩躳觥輁幊嗊塨熕慐澒匔碽銾鞏髸篢觵龏龔" };
			table[L"gou"] = { L"勾句佝沟芶购坸构拘岣狗呴苟诟玽姤枸钩耉耇垢痀袧冓够笱蚼啂耈夠傋訽豿鈎缑雊彀遘鉤溝媾搆詬觏煹構緱褠撀篝糓覯購簼鞲韝" };
			table[L"gu"] = { L"夃古扢估诂抇汩杚谷苽咕呱姑沽泒固孤股轱柧牯故怘骨凅逧唂唃钴鸪罛罟顾羖傦菰菇啒崮崓淈堌梏牿脵蛄蛊笟蓇嗗馉愲尳棝祻軱軲觚辜詁酤雇榾毂稒锢痼賈鈷鈲鼓鼔僱嘏榖鹘皷磆箍箛嫴穀縎篐薣橭糓錮鲴鴣鮕濲臌皼轂餶瀔櫎盬瞽鯝鶻顧蠱" };
			table[L"gua"] = { L"冎叧呙刮坬卦咼呱诖胍挂括剐剮栝铦鸹桰罣掛袿啩絓歄煱罫褂詿趏寡劀緺銛諣踻銽颳鴰騧" };
			table[L"guai"] = { L"夬叏乖拐怪恠柺枴掴摑罫箉" };
			table[L"guan"] = { L"关观纶官贯冠覌矜泴矝莞倌涫惯悺淉馆掼貫悹蒄琯祼棺痯閞窤筦管綸潅遦斡摜慣関瘝輨樌館盥璭錧舘雚罆鳏癏観躀闗鏆關灌瓘鰥爟鳤礶鹳矔罐觀鱞鑵鸛欟鱹" };
			table[L"guang"] = { L"广広灮光犷炛炚炗咣姯挄洸垙茪俇珖桄烡逛胱硄臦輄僙銧潢撗廣黆獷臩" };
			table[L"gui"] = { L"归宄氿圭轨朹攰龟庋妫刿刽匦邽陒佹诡炅规柜昋茥闺姽垝恑贵攱皈癸軌鬼庪帰桂桧祪珪胿軓亀匮匭傀眭硅硊窐袿規趹廆媯猤湀椝椢晷蛫筀貴蓕溎瑰觤詭郌跪厬匱嫢摫瞆閨鲑劌劊嬀嶡撌槣槶槻槼螝鳺龜樻璝瞡檜禬簋瞶簂鮭巂嶲櫃歸癐襘蟡雟鬶騩櫰櫷瓌鐀鳜蘬鞼鬹鑎鱖鱥" };
			table[L"gun"] = { L"丨衮袞绲惃硍辊棍蓘裷睔滚滾緄蔉磙緷輥鲧鮌謴鯀" };
			table[L"guo"] = { L"囗过囯呙果囻咼囶国圀郭涡埚敋國惈堝菓淉馃崞猓喐啯帼渦過腘褁鈛聒锅腂楇椁墎瘑彉漍濄裹綶粿聝蜾蝈嘓慖槨蔮幗虢輠膕鍋餜彍蟈簂馘懖櫎鐹矌" };

			table[L"ha"] = { L"哈紦铪奤蛤鉿" };
			table[L"hai"] = { L"亥还妎咍郂拸孩骇咳害海胲氦烸絯猲嗐餀嗨酼骸還駭醢駴嚡饚" };
			table[L"han"] = { L"厂厈邗汉仠汗忓扞屽犴闬邯含汵攼罕旰佄旱肣函顸虷凾浫笒悍圅垾涆浛唅哻莟娢捍猂琀蚶梒焊焓晘涵晗釬菡閈崡嵅皔喊韩寒睅頇酣馯筨颔甝蛿傼椷蔊鳱蜬蜭嫨撖谽漢鋎鋡憨銲澏暵輚熯翰魽螒頷馠撼憾韓顄駻鼾歛雗譀豃闞瀚鶾" };
			table[L"hang"] = { L"夯邟苀迒吭妔沆忼杭斻巷绗桁蚢航笐颃裄貥絎筕頏魧" };
			table[L"hao"] = { L"乚号好昊呺郝秏侴昦茠蚝恏悎耗浩哠晧毫淏皓傐鄗椃聕蒿嗥號滜滈獆貉噑暤暠獔豪獋皜諕暭皞嘷澔皡薅曍儫薃薧嚆壕皥濠嚎藃鎬颢蠔籇灏譹顥鰝灝" };
			table[L"he"] = { L"禾合吓纥何诃呙郃劾苛呵和咼咊姀抲河阂狢峆饸垎贺柇曷盇籺紇荷哬核敆欱盍盉袔釛隺菏萂啝寉涸渮焃盖盒龁喝喛猲惒粭賀訸訶颌蓋嗬嗃阖澕煂毼楁碋詥貉貈鉌鲄熇熆朅鹖褐赫閤閡餄麧噈鹤頜螛翮翯篕魺嚇壑癋謞燺爀礉闔鞨齕覈蠚鶡皬鑉鶴鶮龢靍靎鸖靏" };
			table[L"hei"] = { L"黒黑嗨嘿潶" };
			table[L"hen"] = { L"佷很哏狠拫恨痕詪鞎噷" };
			table[L"heng"] = { L"亨恆恒姮涥哼悙烆桁珩胻啈鸻脝撗横衡橫鴴蘅鑅" };
			table[L"hong"] = { L"厷讧仜弘红屸叿妅纮灴瓨汯玒宏闳呍吰吽苰轰宖玜泓紅垬荭沗訇洪羾娂虹哄翃竑紘訌烘耾晎唝浤浲紭軣谹硔鸿葒粠硡竤揈葓渹焢溄渱鈜閎谼愩翝嗊綋魟鞃閧鉷潂慐銾澒鋐撔篊谾蕻黉輷鬨彋闂霐薨闀鴻霟鍧嚝巆轟黌" };
			table[L"hou"] = { L"后犼吼吽郈呴洉垕厚矦逅後茩侯候鄇豞堠喉帿猴葔鲎銗鲘瘊睺篌翭糇骺翵鍭餱鮜齁鯸鱟" };
			table[L"hu"] = { L"互弖户戶戸乎冱匢许芐戏虍乕芴帍护抇沪沍汻囫苸弧和呼狐岵泘垀怙戽枑昒昈忽曶虎姱浒恗轷烀祜瓳怘胡芔匫俿壶核粐笏隺萀唿唬婟壷淴淲惚斛扈焀瓠虖葫喖媩猢壺搰湖楛琥鹄虝絗軤鄠嗀嗃煳楜瑚瓡綔雽蔛蔰嘝嘑寣嫭嫮摢滹滬滸鹕雐幠戯熩槲槴歑蝴糊縎箶鳸魱衚濩戱膴螜縠醐錿頶戲簄觳豰鍙鍸餬嚛鹱礐謼鵠瀫鬍觷護鶘鶻鶦鰗鳠鶮頀鸌鱯" };
			table[L"hua"] = { L"化划华夻花芲吪呚话画枠杹砉姡骅哗婲華崋桦婳铧釪釫猾畫滑觟畵嘩撶搳話嬅劃磆樺摦槬錵鋘蕐諣諙嫿螖澅譁黊繣舙鏵譮蘤驊鷨" };
			table[L"huai"] = { L"坏怀佪徊咶淮槐踝褢褱壊懐壞懷瀤櫰耲蘾蘹" };
			table[L"huan"] = { L"幻欢犿肒奂还郇环峘狟奐荁洹宦浣换涣烉桓唤垸患梙萑焕萈逭堚嵈換雈睆痪寏絙渙喚喛愌缓羦煥瑍綄貆豢蒝獂瘓漶锾緩鲩槵瞏歓鴅還阛寰嬛擐澴澣缳圜懁雚環鍰豲镮鵍鯇鹮藧酄繯糫攌懽鰀嚾孉轘鯶獾鐶闤歡鬟瓛貛讙驩" };
			table[L"huang"] = { L"巟肓汻怳衁皇荒炾恍晄晃宺隍黄朚凰偟谎奛崲黃葟徨遑惶慌喤媓湟塃揘堭幌楻滉愰煌詤瑝潢锽墴榥獚熀蝗艎篁皝璜曂熿謊諻癀磺穔餭兤鳇蟥鍠簧鎤趪韹櫎爌鐄皩騜鰉鷬鱑" };
			table[L"hui"] = { L"卉屶屷汇囘会讳回灰灳囬佪诙廻泋诲廽茴荟迴咴哕挥拻洄浍洃绘恢恛袆芔虺逥悔贿珲烩烠烣桧晖恚恵蚘豗彗婎堕晦秽痐隓廆喙阓媈揮溃湏缋辉惠蛔蛕絵翚翙匯彚彙滙琿煇椲楎暉禈毁毀會蜖賄詼詯颒僡蔧幑嘒墮睳瘣褘誨銊蕙噅噕寭撝潓潰圚憓槥暳慧螝翬輝麾薈薉徻噦嬒獩澮濊殨橞毇璤諱頮隳藱徽燬燴檜檅檓璯篲餯鮰嚖瀈懳穢瞺蟪繢櫘繪翽譓儶蘳譭鏸闠孈鐬靧譿顪鰴" };
			table[L"hun"] = { L"忶诨昏荤眃昬俒浑倱珲圂惛焄涽阍混掍馄婫婚湣葷棔棍焝湷渾殙琿魂溷睧睴觨睯慁蔒尡諢閽餛轋鼲" };
			table[L"huo"] = { L"火灬邩伙沎吙佸或货和钬姡活咟閄秮获眓俰捇秴祸秳剨喐掝貨湱耠惑鈥旤禍锪窢漷趏蒦煷夥劐篧嚄霍濊濩擭獲奯鍃檴豁謋雘矆镬礊穫彟藿騞艧耯蠖嚯攉瀖嚿臛曤癨矐鑊韄靃彠" };

			table[L"ji"] = { L"乁几丌亼亽及己彑丮讥计尐旡刉击伋记叽饥乩屰刏伎芨彶吉妀犱岌汲级纪圾忣机玑肌际即芰妓技汥泲坖极忌皀鸡矶系其剂亟郆佶诘苙奇季枅虮卽叝荠茤茍迹咭哜姞挤济洎给垍既急皍級紀笈計剞剤唧姬屐揤继堲觊脊积疾畟紒笄觙記飢偈偮卙徛庴帺寄寂掎済淁绩基悸焏旣梞楖祭谻鱾葪蔇喞嵇嵆湒缉幾赍殛戢戟棘極犄敧惎期朞攲給筓臮集際兾勣蒺蓟嗘嫉嵴塉愱辑楫稘痵畸蝍継裚趌跻跡鬾麂鳮魝僟摖漈漃槉暨禝毄膌穊稩耤綨緁箕誋跽銈銡鲚霁魢魥蕺蕀嘰嶯撠潗濈槣樭暩撃稽稷瞉瘠鹡畿齑緝箿觭躸諔諅諆趞踑踖鲫鞊冀劑隮薊撽激墼憿檝機橶曁禨璣穄積襀螏輯錤髻藉薺嚌擠濟懠檕擊穖磯磼羁罽襋繋績簎簊賷覬蹐鍓鮆檵櫅櫭璾蟣耭艥蹟雞鵋鯽齌蘎廭骥懻穧癠繫譏韲鶏鯚蘮瀱繼籍轚譤鏶鐖饑霵鱀癪躋鞿魕鶺鷄齎蘻虀羇鑇霽鷑鰶鰿覉鑙齏羈躤鸄覊鱭驥雧" };
			table[L"jia"] = { L"加甲价夹伽扴抸宊忦圿夾泇岬驾拁迦郏佳郟浃玾挟拮珈架毠枷叚胛荚徍痂斚贾埉莢浹挾哿唊家钾恝袈耞笳梜袷铗脥戛假蛱戞颉颊跏傢裌葭徦婽猰猳斝腵嫁幏鉫鉀椵蛺賈犌槚榎榢嘉瘕镓擖鋏頬價駕頰稼鴐貑豭鴶檟鎵鵊麚" };
			table[L"jian"] = { L"见戋件幵奸囝尖间坚歼見冿建饯拣浅戔枧玪肩艰剑俭茧荐姦姧洊贱柬牮剣兼健俴倹捡挸涧笕栫珔监舰减剪剱谏菅菺徤帴猏揵渐湕堑堅惤检梘袸笺豜趼釰釼傔葌寋揃揀溅湔減缄堿旔毽楗検犍牋朁腱锏睑硷裥臶詃践跈間閒雃靬谫蒹弿搛缣煎椷椾暕瑊瑐键睷碊絸筧简賎鉴僭僣蔪漸塹戬戩槛榗監碱箋劎劍儉蕑蕳澗熞樫稴鹣糋緘翦箭賤諓趝踺踐鋑鋄鲣鳽劒劔薦撿熸橏縑篯諫鋻鍵餞藆檢瞯瞷磵礀襇襉螹艱謇蹇鍳餰鞬馢擶濺瀐檻瞼礆繭繝簡謭鎫鳒鞯鵑瀳殱礛籈覵覸譛鏩鬋鹸鵳鰎攕瀽瀸蠒聻艦鐧鐗鰔殲櫼轞譼鐱鹻鶼鰜礷籛譾鑒鑑韀鰹虃囏襺鑬鹼鑯鑳韉" };
			table[L"jiang"] = { L"匞匠夅讲江弜降姜绛洚奖将茳畕浆桨豇將強弶强絳傋塂港蒋葁酱畺奨翞勥滰摪蔣奬僵嵹槳螀獎漿摾壃耩膙薑彊缰犟螿鳉醤講殭糡橿疅糨礓醬繮疆謽顜韁鱂" };
			table[L"jiao"] = { L"叫交呌臫角郊侥佼茭茮骄娇姣狡峧峤饺挢挍浇绞恔觉訆捁悎轿较烄校晈珓胶笅教敎斍脚皎铰矫窌覐釥喬搅湫焦椒窖蛟絞筊覚剿勦滘煍敫湬腳賋較跤僬僥嘐嘄嘂嘦摷摎漖斠暞虠酵踋鉸餃鲛劋儌蕉徺噍嬌嶠嶕嶣撟撹澆潐憍憢樔膠徼噭嬓獥缴憿燋敽敿膲曒璬穚癄鹪礁矯鵁鮫藠皦蟜蟭簥轇繳轎譑醮趭嚼孂灂覺譥鐎皭驕攪灚鷦鷮鱎釂龣" };
			table[L"jie"] = { L"卩卪孑丯介尐讦节阶价她扢刧刦劫芥庎吤妎岊岕戒杢昅疖刼劼诘姐届屆斺杰玠毑疌衱诫迼哜狤拮洁结皆疥砎界畍衸倢借莭悈桔桀桝洯袓蚧紒訐階偈偼菨徣唶啑婕媎崨接捷掶掲秸痎袺袷傑嗟喈喼媘媫嫅嵑揭湝堦堺椄脻裓蛣絜結颉街嵥搩滐煯楷楬楐楶琾瑎睫蜐蛶節解觧詰趌跲鉣飷骱蓵截榤犗稭竭碣耤誡鲒鞂價嶱擑潔褯蝔镼誱踕鞊頡魪羯幯嶰擳藉嚌嶻擮檞礍鎅鍻鮚巀癤謯蠞蠘鶡鶛蠽" };
			table[L"jin"] = { L"巾今仐仅斤钅劤伒尽劲进近妗兓侭卺枃竻金釒勁荩荕巹津浕矜砛衿觔浸埐赆烬晋晉珒矝紧紟笒菫菳進唫婜堇惍祲琎堻煡琻臸筋釿厪僅谨寖搢溍缙锦禁靳蓳廑嫤馑漌墐慬榗瑨盡緊馸凚僸殣觐槿歏瑾璡黅鹶儘噤嬐濅縉賮錦藎嚍嬧濜壗燼璶襟覲謹饉贐齽" };
			table[L"jing"] = { L"井丼阱劤刭劲巠宑妌汫坓坕坙净京茎径迳弪泾经汬肼剄勁俓亰荆荊婙浄胫秔穽凈倞莖徑逕弳涇竞痉粇菁婧婛猄淨惊殑殌旌旍桱梷脛竟竫経颈葏敬晶景腈稉竧痙靓傹睛粳經靖兢儆獍境聙精綡箐誩踁静頚幜擏澋憬璄鋞靚橸暻曔璟璥憼镜靜鲸頸瀞蟼鵛警鏡麖鶄鶁鯨競鼱竸驚麠" };
			table[L"jiong"] = { L"冂冋冏囧炅迥泂炯扃坰逈侰埛浻扄絅烱颎窘煚臦綗煛僒銄熲駉澃褧駫燛顈臩蘏蘔" };
			table[L"jiu"] = { L"九丩久乆乣勼旧匛氿纠汣朻臼奺牞杦灸玖鸠究糺咎疚舏糾柩赳韭柾酒捄桕镹紤阄倃匓厩救萛就韮廄廐啾揂揪鳩揫舅剹稵廏僦摎慦樛殧舊鹫匶鬏麔鯦欍齨鷲鬮" };
			table[L"ju"] = { L"巨且凥句伡讵邭苣姖岠局拒抅洰怇車具匊苴弆咀驹狙岨居拘拠泃沮泦怚怐炬柜昛歫举俥莒枸狊珇秬钜矩剧陱俱倨倶挶毩桔挙眗疽砠罝袓蚷耟粔郹菊啹娵婅婮崌掬据渠涺淗埧埾惧焗梮詎距揟湨焣飓毱椐椈椇犋琚腒锔筥趄跔跙鉅蒟蒩榉榘犑锯裾虡輂豦龃雎僪蓻寠愳窭蜛聚粷艍跼閰駏劇勮屦聥躹諊趜踞踘鋦駒鮔遽據澽壉懅橘螶窶舉踽鋸鴡鮈屨檋擧颶鞠駶瞿繘貗鞫鵙簴蹫鵴鶋蘜巈櫸醵躆鶪鼰齟忂懼欅鐻鼳驧" };
			table[L"juan"] = { L"奆劵卷奍呟弮巻帣姢桊隽悁埍绢涓捐勌狷娟倦菤梋鄄焆眷惓圈脧淃捲婘瓹朘腃睊絭鹃罥裐椦棬圏雋锩睠絹飬勬镌慻蔨鋗鋑餋闂錈鞙臇獧縳鎸羂嶲巂鐫讂蠲" };
			table[L"jue"] = { L"亅孓孒决刔诀氒芵弡吷妜抉決角叕泬玦玨挗绝觉珏疦砄虳倔捔埆欮袦蚗崛崫掘桷斍覐觖訣赽趹厥傕焳矞絶絕覚趉鈌瑴劂谲駃蕨蕝噘噊獗嶡嶥撅撧憰熦爴瘚觮誳鴃鴂噱壆燋橛橜璚憠臄爵镢屩櫭蟩蟨繘屫爑譎蹶蹷髉匷嚼矍覺鐍鐝鳜灍爝觼穱彏玃攫戄鷢矡貜躩钁" };
			table[L"jun"] = { L"军龟均汮呁君钧軍袀姰陖俊郡隽蚐埈浚捃馂峻莙骏菌晙桾珺皲焌棞鈞雋畯竣葰筠碅皸銁銞覠儁賐箟蜠箘皹懏餕鲪寯麇燇龜頵濬駿鍕鵘鮶鵕鵔麏麕攈攟" };

			table[L"ka"] = { L"卡佧咖咔咯胩喀鉲" };
			table[L"kai"] = { L"开岂忾剀凯炌恺垲闿奒欯烗铠勓锎開愒剴慨蒈凱揩嘅塏輆嵦楷愾愷暟锴濭鍇鎧鎎闓颽鐦" };
			table[L"kan"] = { L"凵刊冚扻坎侃衎砍看莰崁栞勘龛惂埳偘堪欿嵌嵁戡歁槛墈阚輡瞰磡檻顑闞竷轗鬫龕矙" };
			table[L"kang"] = { L"亢邟伉匟扛忼囥抗犺闶炕钪砊粇康閌鈧嫝漮慷嵻槺穅糠躿鏮鱇" };
			table[L"kao"] = { L"丂尻考攷拷洘烤栲铐嵪犒銬鲓靠髛薧鮳鯌" };
			table[L"ke"] = { L"可壳克匼岢呵苛刻坷炣柯轲牱牁珂科恪峇客咳剋勊勀钶疴砢欬袔趷悈尅课娔渇殻铪氪骒堁蚵硞翗痾軻颏衉嵑萪嵙缂殼愘揢敤渴棵愙溘閜鈳嗑窠稞歁锞犐搕碦磆颗榼薖磕嶱頦瞌課艐緙蝌樖錁窼濭醘髁顆騍礚礊" };
			table[L"ken"] = { L"肎肻肯垦珢恳掯裉硍啃龂褃豤貇龈墾錹懇" };
			table[L"keng"] = { L"劥阬吭妔坑坈挳硁牼殸铿揁硜硻摼誙銵鍞鏗" };
			table[L"kong"] = { L"孔空矼倥恐崆悾埪涳控椌硿箜羫錓鞚鵼" };
			table[L"kou"] = { L"口叩扣佝芤抠劶怐眍敂宼眗冦竘寇釦窛筘剾摳滱彄蔲蔻瞉瞘簆鷇" };
			table[L"ku"] = { L"扝库郀矻苦刳狜枯胐朏绔俈挎捁窋秙庫哭桍焅堀袴喾楛圐跍搰硞絝裤瘔窟酷骷褲鮬嚳" };
			table[L"kua"] = { L"夸侉咵姱挎垮恗晇胯趶楇絓誇跨銙骻" };
			table[L"kuai"] = { L"巜凷会快块侩郐哙狯浍脍欳蒉塊會蒯筷鲙駃墤儈鄶澮擓獪噲廥璯膾旝糩鱠" };
			table[L"kuan"] = { L"宽梡欵款寛歀寬窽窾臗髋髖" };
			table[L"kuang"] = { L"卝丱邝匡圹纩夼狂忹况抂狅旷迋邼岲诓況矿劻昿贶恇匩洭哐诳眖砿框軠軖眶硄絋軦貺筐絖軭鉱筺誆誑鋛鄺儣壙黋懭鵟爌懬曠礦矌穬纊鑛" };
			table[L"kui"] = { L"亏刲岿尯奎悝晆胿盔逵馗隗匮鄈傀葵愦愧溃揆馈媿骙喟喹蒉暌楏煃戣頍魁楑窥跬磈匱睽瞆篑聭聧聩蝰蕢嘳嬇潰憒膭頯窺謉殨藈餽鍷鍨虧瞶櫆鮭顝聵蹞簣闚騤籄饋蘷巋夔虁巙犪躨" };
			table[L"kun"] = { L"困昆坤阃悃捆涃菎祵晜梱裈堒堃壸崐崑猑婫裍髠硱睏稇琨焜稛锟鹍裩綑髡貇壼髨潉褌蜫醌閫瑻熴閸鲲錕騉鵾鯤鶤" };
			table[L"kuo"] = { L"扩拡括挄秮铦秳葀筈蛞阔萿漷廓銛噋銽頢髺濶韕鞟闊擴霩鞹鬠" };

			table[L"la"] = { L"旯拉垃剌柆砬菈翋啦喇揦揧楋搚辢辣蝋瘌蜡蝲臈磖擸藞邋攋鬎臘爉镴瓎嚹櫴鯻蠟鑞" };
			table[L"lai"] = { L"来來疠俫倈莱郲徕涞娕崃梾赉淶崍猍婡唻庲逨徠萊睐铼琜筙棶睞赖箂誺賚賫賴濑錸頼癘顂騋癞鵣籁麳鶆鯠藾攋瀨瀬櫴襰癩籟" };
			table[L"lan"] = { L"兰坔岚拦栏烂览浨惏啉婪葻缆揽嵐阑蓝暕榄滥谰漤罱褴醂厱澜斓壈懒篮覧燗儖闌嚂藍镧燣燷懢濫襕壏爁璼擥懶幱譋襤嬾蘫繿蘭籃孄攔瀾灆欄瓓斕覽爛襴籣灡囒孏灠躝欗攬爤讕顲鑭爦欖襽糷纜钄韊" };
			table[L"lang"] = { L"勆郎郞欴朗埌浪崀狼阆哴莨嫏朖斏琅蓈桹烺啷廊榔硠锒稂瑯艆郒筤蓢蜋塱蒗樃螂躴誏鋃閬朤鎯駺" };
			table[L"lao"] = { L"耂老労牢劳佬荖窂恅络狫姥咾崂捞涝浶珯哰栳烙唠铑絡痨铹閖勞嗠酪耢僗銠嫪憦澇潦撈嶗嘮躼橯憥磱癆耮簩蟧醪轑軂鐒顟髝" };
			table[L"le"] = { L"了阞仂氻乐忇扐叻艻牞玏肋泐竻饹砳勒楽餎韷樂簕鳓鰳鱳" };
			table[L"lei"] = { L"肋耒厽泪诔类垒洡涙勒祱累淚絫塁誄傫雷瘣嫘嘞銇缧蔂酹樏磊畾蕌頪頛蕾磥錑擂檑縲儡礌颣攂镭癗壘藟矋櫐櫑類羸瓃礨礧罍蠝纇纍蘲灅鐳蘽轠蘱讄鑘靁壨禷儽虆欙鑸鸓纝鼺" };
			table[L"leng"] = { L"冷倰唥堎塄愣棱楞稜睖碐踜薐" };
			table[L"li"] = { L"力历厉屴扐礼立刕吏扚朸丽利励叓苈呖沥坜李杝里例叕苙迣岦沴沵戾枥疠隶厘郦俚俪俐荔茘峛峢轹柂栎栃疬砅赲剓莉莅荲逦哩唎骊娌娳狸猁峲涖浰悝离悧栗栛珕秝砬砺砾浬菞唳婯悷梨梸犁理琍悡脷蛎蚸粝粒笠凓厤傈喱棃棙犂锂痢鹂裡蛠詈跞雳厯剺蓠蒞蒚搮漓溧缡塛慄睝睙蜊粴艃筣豊鉝鳨裏厲嫠孷樆暦璃瑮歴竰盠蜧綟貍銐蔾犛褵蝷糎鋫鋰鲡鲤黎勵澧曆歷罹縭篱篥錅隷鴗巁濿檪禮癘磿蟍謧醨隸鬁儮藜邌嚟擽爄櫔犡曞禲蠇釐鎘離鯉鯏藶嚦攊瀝壢櫟斄瓅瓈礪蟸鏫麗鵹鯬爏櫪瓑皪盭礫蠣糲醴黧酈儷蘺囄灕癧礰蠡蠫纅鳢麜鷅邐廲囇孋攦轢觻躒劙欐轣讈鑗攭瓥穲籬靂鱧欚纚鱱靋驪鸝鱺" };
			table[L"lia"] = { L"俩倆" };
			table[L"lian"] = { L"连奁帘练怜炼莲莶連涟恋殓梿敛琏脸僆萰媡湅堜链裢裣联亷蓮廉嗹摙漣溓慩煉楝瑓匲蔹奩潋熑槤槏璉覝劆匳噒嫾憐稴磏褳聨聫練鲢薟薕嬚濂澰濓螊聮縺翴錬鄻殮燫櫣斂歛臁臉聯謰蹥鍊檶镰襝鏈鎌瀮蠊簾羷蘞蘝瀲醶鬑鰊鐮鰱戀籢籨纞" };
			table[L"liang"] = { L"両两良兩亮俍俩倞倆谅莨唡哴凉悢梁辆涼掚啢湸辌喨椋晾脼量裲粮粱輌墚踉緉蜽輛輬諒樑鍄魉魎駺糧" };
			table[L"liao"] = { L"了辽尥疗钌尦炓料釕聊窌尞鄝膋嵺寥廖撂摎蓼漻僚缪憀敹憭樛嶚嘹缭寮嫽獠嶛遼撩潦橑暸璙燎膫窷竂鹩繆瞭镣療賿藔蹘豂簝繚屪蟧蟟廫爎镽蹽爒鐐飂髎飉鷯" };
			table[L"lie"] = { L"列劣劦忚劽冽挒洌姴咧迾茢烈烮埒浖栵埓哷脟捩猟猎棙裂蛚煭趔聗綟巤颲獦燤巁儠鴷鮤獵爄擸犣爉躐鬛鬣鱲" };
			table[L"lin"] = { L"厸邻阾吝拎林临恡悋冧赁淋崊啉惏菻焛晽琳粦痳碄賃亃箖綝粼鄰隣僯蔺潾凜凛撛遴嶙獜燐澟霖廩懔膦璘懍甐暽廪橉閵斴辚瞵檁檩磷疄臨麐癛繗癝翷轔蹸藺瀶鏻鳞壣躏驎鱗麟躙躪轥" };
			table[L"ling"] = { L"令另刢伶灵呤坽囹夌泠岺岭狑姈彾苓朎玲瓴昤柃炩凌皊秢铃竛鸰砱袊羐陵翎羚领笭舲绫衑紷聆蛉菱琌婈掕棂崚淩祾跉詅軨棱稜閝鈴龄零裬蓤綾領蔆霊駖輘霗澪鹷魿鴒鲮錂蕶燯霛霝嶺齢酃鯪孁蘦齡櫺醽靈麢欞爧龗" };
			table[L"liu"] = { L"六刘畄斿浏柳栁珋桞流留绺旈桺琉窌翏硫畱裗锍廇塯碌遛溜旒蓅骝媹馏嵧蒥綹瑠榴摎熘飗漻瑬澑劉罶磂鋶駠鹠熮瘤镏疁橊橮璢磟镠鹨駵蟉癅蹓麍懰瀏霤餾嚠鎏嬼藰鎦羀鏐雡飀鬸騮飂鐂飅鶹鰡驑鷚" };
			table[L"long"] = { L"龙屸尨陇弄茏咙垅垄泷拢昽栊珑胧竜砻哢眬隆梇聋笼湰硦滝嶐漋槞篢癃篭窿龍鏧霳儱隴壠壟瀧巄巃嚨徿蘢襱瓏攏朧曨爖櫳竉礱礲龒矓龓躘豅籠聾蠬蠪贚靇鑨驡鸗" };
			table[L"lou"] = { L"陋娄偻屚婁蒌溇搂喽嵝楼僂嘍瘘镂慺塿漊蔞摟遱廔漏嶁寠篓耧蝼甊樓熡瞜瘺瘻簍螻艛耬軁謱貗髅鏤鞻髏鷜" };
			table[L"lu"] = { L"六卢圥甪卤陆芦庐侓录彔泸垆坴炉枦虏峍轳栌胪陸勎赂辂鸬舮菉逯娽掳渌淕淥绿硉玈舻鹵鹿颅椂禄祿琭硵鈩鲁剹勠僇稑盝睩碌虜賂輅路鲈蓼蔍蓾廘摝漉滷塶塷粶緑箓馿噜撸澛辘戮熝樚樐膔醁趢踛魯魲蕗擄潞氇橹穋盧磠録錄錴璐穞镥螰簏謢鴼嚕擼瀂鹭簶轆蹗騄蘆廬嚧獹攎瀘壚氌櫓璷艣簬簵鏕鏀麓鵦鵱鯥爐櫨曥瓐臚矑艪鏴鐪露騼蠦罏纑艫籙籚觻轤鑥虂鑪鷺髗顱鸕鱸黸" };
			table[L"luan"] = { L"卵乱孪娈峦挛栾釠乿鸾脔滦亂銮薍鵉覶巒孌圝奱孿欒灓攣曫羉臠臡圞灤虊鑾癴癵鸞" };
			table[L"lue"] = { L"寽畧稤鋝鋢掠略锊圙" };
			table[L"lun"] = { L"仑伦论芲囵抡沦纶侖轮倫陯埨惀圇淪掄崙崘婨菕棆腀碖溣稐蜦耣綸輪論踚磮錀鯩" };
			table[L"luo"] = { L"寽剆罗泺荦络洛咯峈骆倮砢珞洜烙捋逻硌萝脶渃啰捰猡腡跞落蛒硦笿椤絡锣裸蓏詻骡漯犖箩雒摞躶瘰镙頱駱磱鵅螺鮥擽濼羅蠃攊鏍覶攎皪儸臝騾覼玀囉躒攞邏蘿欏曪驘攭鸁籮纙癳鑼饠囖" };
			table[L"lv"] = { L"吕驴呂郘侣挔捛垏闾律侶梠祣哷旅虑捋稆铝率绿偻缕屡嵂絽葎氯滤僂榈屢褛閭鋁膂綠緑慺慮箻膢膟氀履瞜褸膐縷勴繂儢櫚濾藘櫖爈穭卛鷜鑢驢" };
			table[L"lve"] = { L"掠略锊圙" };

			table[L"m"] = { L"呒呣" };
			table[L"ma"] = { L"亇马孖犸妈吗玛祃杩码抹骂閁蚂唛馬麻菻傌溤獁媽睰痲痳嗎遤榪嫲禡嘜瑪蔴犘罵碼摩螞駡鎷鬕鷌鰢" };
			table[L"mai"] = { L"劢迈买麦佅売卖荬脉埋脈麥買衇勱嘪邁賣薶霡霢霾鷶" };
			table[L"man"] = { L"悗埋娨屘曼蛮満满鄤僈谩絻馒慲慢蔄墁缦幔滿漫嫚摱獌瞒熳樠槾澫颟鞔螨瞞镘澷縵蟎謾鏝鏋饅鳗蘰顢鬘鬗鰻矕蠻" };
			table[L"mang"] = { L"邙芒忙汒吂杧牤杗尨盳盲氓笀恾厖茫娏狵庬浝莽哤朚釯硭铓牻莾痝硥茻蛖漭壾鋩蟒蠎駹蘉" };
			table[L"mao"] = { L"冇冃毛夘卯矛皃芼茆茅茂枆牦峁戼泖冐眊秏柕贸昴冒旄耄铆罞渵猫袤酕覒軞笷貿鄚萺帽媢嵍堥瑁蓩鉚锚毷楙愗暓貌髦鉾鄮緢瞀蝐蝥貓犛髳氂錨蟊懋鶜" };
			table[L"me"] = { L"么庅麽麼嚒嚜嚰" };
			table[L"mei"] = { L"毎没沒坆每苺沬抺枚妹玫祙栂昧眉袂美凂羙脄浼眛挴莓郿脢珻梅媄睂葿痗嵋嵄湄寐媒渼媚跊猸堳殙鬽湈禖楣瑂楳腜煝煤媺镅魅鹛睸韎酶镁塺槑蝞篃鋂霉嬍穈燘徾糜鎂鎇嚜櫗黣鶥攗黴" };
			table[L"men"] = { L"门们扪闷汶钔玧門怋們悗閅捫惛焖菛悶椚暪璊瞒鍆瞞鞔穈燜懑懣亹斖虋" };
			table[L"meng"] = { L"尨黾甿孟氓虻莔勐冡庬猛掹梦萌黽雺锰盟溕夢蒙艋甍蜢夣鄳瞢蝱鄸鋂髳儚蕄橗幪錳獴擝蟒濛懜懞朦曚檬氋礞鯍霥矇鹲懵艨蠓鯭矒饛霿靀顭鼆鸏" };
			table[L"mi"] = { L"冖糸米汨沕侎觅怽枈宓羋泌弥沵峚咪弭迷洣祕祢粎脒宻秘袮敉密淧眯猕谜覔覓谧幂渳葞蒾覛塓詸幎銤榓瞇鼏蜜熐嘧摵蔤滵漞蔝冪樒醚濗謎幦麋謐麊麿藌縻彌糜濔瞴擟櫁檷羃簚禰靡蘪瀰麛獼镾戂灖孊攠蘼瓕爢醿醾鸍釄" };
			table[L"mian"] = { L"宀丏汅芇免杣沔黾靣面勉眄娩莬眠偭勔婂冕渑绵黽棉睌缅葂喕媔湎愐牑腼絻綿澠蝒糆緜麫麪緬臱麺靦嬵檰鮸櫋矊矈麵矏" };
			table[L"miao"] = { L"厸仯劰妙杪庙苗眇竗玅秒庿喵媌描淼缈渺瞄鹋缪嫹緢廟緲篎邈藐繆鶓" };
			table[L"mie"] = { L"乜灭吀芈咩旀眜哶烕孭覕搣滅蔑薎鴓懱瀎幭篾櫗簚礣蠛衊鑖鱴" };
			table[L"min"] = { L"皿民刡冺忟闵泯怋垊旻旼忞玟抿岷姄黾呡苠珉闽砇盿勄敃罠悯笢敏笽渂捪崏黽閔琝琘惽缗湣湏瑉暋愍敯痻碈鈱僶閩緍潣緡憫慜賯錉鴖鍲簢鳘蠠鰵" };
			table[L"ming"] = { L"名鸣佲命明茗姳眀洺冥眳铭掵朙鄍凕慏溟猽嫇蓂酩詺銘鳴暝榠瞑螟覭" };
			table[L"miu"] = { L"谬缪繆謬" };
			table[L"mo"] = { L"万末庅圽沒没妺帓抹歿歾殁茉沫陌狢枺昩尛帞冒皌眜眿砞秣莈莫眽袹絈絔谟貃蛨貉貊漠塻貈蓦嗼摸馍獏寞嫫膜麼摹麽模骳銆靺嘿黙魹瘼瞙瞐嫼魩镆墨摩糢橅縸默磨嬷謨謩嬤懡瀎貘蟔藦嚜嚤擵饃鏌爅蘑髍魔驀癦纆礳劘攠戂耱饝" };
			table[L"mou"] = { L"厶牟侔呣劺哞敄恈某桙眸谋堥蛑缪踎謀繆鍪麰鴾鞪" };
			table[L"mu"] = { L"木目仫母朷凩牟狇沐牡亩姆畂苜拇炑坶牧牳畒畆峔姥胟畞钼砪畝毣毪蚞娒莯莫畮雮募楘鉬鉧睦慔墓幙幕暯暮模氁慕缪踇霂樢艒縸穆繆鞪" };

			table[L"na"] = { L"内那纳抐妠呐吶乸肭郍哪衲娜钠南拏秅袦納拿挐捺笚笝軜雫豽貀鈉靹嗱蒘蒳搻誽镎魶鎿" };
			table[L"nai"] = { L"乃艿奶氖疓佴妳奈廼迺耐耏柰釢倷能萘渿腉搱鼐褦摨螚錼孻嬭" };
			table[L"nan"] = { L"囡囝男妠枏抩南柟侽难娚莮畘赧揇湳婻喃萳煵腩暔楠嫨蝻諵難戁" };
			table[L"nang"] = { L"乪涳搑擃憹嚢瀼曩囊蠰儾灢攮馕囔欜饢齉" };
			table[L"nao"] = { L"呶闹怓垴恼挠孬峱桡悩脑匘硇婥铙淖脳堖猱惱蛲詉瑙腦碙嫐閙碯摎鬧撓橈憹嶩臑蟯獶夒譊鐃巎獿" };
			table[L"ne"] = { L"疒讷呐吶抐呢哪眲訥" };
			table[L"nei"] = { L"内內那氝哪氞娞馁浽脮腇餒錗鮾鯘" };
			table[L"nen"] = { L"恁媆嫩嫰" };
			table[L"neng"] = { L"能螚" };
			table[L"ni"] = { L"尼氼屰拟抐伱伲你泥抳坭怩狔妳妮呢苨柅胒逆昵籾郳秜铌匿倪眤屔掜淣堄埿猊蚭旎婗跜晲蛪惄棿睨腻孴鈮愵嫟溺暱馜聣蜺疑貎誽觬輗縌霓鲵隬儗儞膩嬺懝薿濔擬檷麑鯢聻齯臡" };
			table[L"nian"] = { L"卄廿年念秊拈姩哖秥涊唸捻淰埝惗悥辇鲇溓艌蔫榐辗碾撚輦撵鲶鮎簐蹍黏攆蹨鯰躎" };
			table[L"niang"] = { L"娘酿嬢孃醸釀" };
			table[L"niao"] = { L"鸟尿茑袅脲鳥嫋溺裊蔦樢嬝褭嬲" };
			table[L"nie"] = { L"乜帇圼苶陧枿峊痆聂臬涅捏掜菍啮隉捻敜揑湼摄嵲嗫踂摰踙槷镊镍噛踗銸篞臲錜鋷颞嶭蹑闑聶鎳嚙孼孽蘖籋櫱攝齧囁糵蠥鑈糱巕囐囓讘躡鑷顳钀" };
			table[L"nin"] = { L"囜拰恁脌您" };
			table[L"ning"] = { L"宁佞狞泞拧咛苧侫柠倿聍寍寕甯寗寜寧澝儜凝橣擰濘薴獰嬣嚀檸矃聹鑏鬡鸋" };
			table[L"niu"] = { L"牜牛妞忸纽沑汼抝扭狃拗怓炄杻钮莥紐鈕靵" };
			table[L"nong"] = { L"农弄侬哝挊浓挵脓秾農儂辳蕽噥濃禯膿檂燶穠癑襛繷譨醲欁鬞齈" };
			table[L"nu"] = { L"奴努伮弩帑驽孥怒砮胬笯傉搙駑" };
			table[L"nuan"] = { L"奻渜湪煖煗暖餪" };
			table[L"nve"] = { L"疟虐婩硸瘧" };
			table[L"nuo"] = { L"娜挪耎诺挼难梛逽喏掿袳毭袲詝傩愞锘搙搦榒搻稬蹃諾鍩橠糑懦懧糥穤難糯儺" };
			table[L"nun"] = { L"黁" };
			table[L"nv"] = { L"女沑钕籹衂恧朒衄釹聏" };

			table[L"o"] = { L"哦喔筽噢嚄" };
			table[L"ou"] = { L"区讴吽呕吘沤怄瓯殴欧鸥禺區偶腢塸漚嘔慪耦膒鴎甌熰毆歐蕅櫙藲藕謳髃鏂鷗" };

			table[L"pa"] = { L"扒汃帊妑苩帕怕杷爬趴钯皅袙耙舥啪琶掱葩筢潖" };
			table[L"pai"] = { L"廹沠拍迫派哌俳猅徘排渒蒎湃棑牌箄輫鎃簰簲" };
			table[L"pan"] = { L"丬爿冸判沜坢肨炍泮拌拚洀眅盻盼胖叛柈牉眫畔袢萠畨盘湴詊番跘蒰幋溿媻頖槃搫潘磐鋬盤縏膰蹒闆磻蟠瀊蹣鎜攀鞶籓襻鑻" };
			table[L"pang"] = { L"乓厐彷夆汸尨肨庞炐胖沗逄旁庬胮眫趽雱舽嫎嗙徬滂膖磅螃篣耪覫鳑龎龐霶鰟" };
			table[L"pao"] = { L"刨抛奅庖咆垉狍拋泡爮炮炰袍砲皰疱瓟袌跁匏脬烰萢軳跑鞄靤麃麭麅藨嚗礟穮礮" };
			table[L"pei"] = { L"阫伂妃坏妚沛犻佩怌帔呸肧抷斾柭柸胚姵俖珮配衃旆陪浿培淠婄赔毰棑琣蓜辔锫媐裴裵馷賠嶏醅霈錇攈轡" };
			table[L"pen"] = { L"呠瓫盆喯葐喷湓噴濆歕翸" };
			table[L"peng"] = { L"芃匉伻亨朋怦泙抨苹竼恲挷胓倗捀砰莑皏烹梈堋硑淜淎袶掽捧弸椖椪棚彭絣軯剻稝痭鹏硼閛碰蓬傰搒塳塜摓漨槰樥漰熢澎憉嘭駍輣輧踫磞韸膨篷篣錋髼鬅蟚蟛鵬韼蘕纄鬔騯鑝" };
			table[L"pi"] = { L"匹丕庀皮疋阰仳伓圮邳伾芘苉吡否妚屁批纰坏狉狓岯披抷坯怶炋枇枈肶毗毘砒郫陴悂秛秠铍疲罢被蚍紕笓副啤猈崥淠埤旇脴蚾蚽耚翍豼揊琵焷禆脾腗痞豾鈚釽媲嫓榌裨辟鈹鉟鲏潎膍稫罴蜱銔銢劈隦僻嶏磇罷諀髬駓鴄魮噼擗澼壀螕錃錍魾鮍噽嚊濞甓憵螷篺貔鞞鵧癖礔礕鎞嚭羆疈譬朇闢霹鼙蠯鸊鷿" };
			table[L"pian"] = { L"片囨便骈扁胼偏覑谝缏貵腁骗媥猵犏楩楄賆跰瑸緶翩篇骿駢諞蹁獱璸騈騙騗鶣" };
			table[L"piao"] = { L"朴莩票殍勡剽僄骠嫖彯漂缥慓徱嘌飘瓢瞟薸篻翲縹螵旚醥犥闝皫飄飃魒顠驃鰾" };
			table[L"pie"] = { L"丿氕苤覕嫳撇潎暼撆瞥鐅" };
			table[L"pin"] = { L"朩牝汖拚贫玭品姘砏拼娦貧琕频聘榀嫔嬪薲穦矉礗嚬蘋蠙颦馪顰驞" };
			table[L"ping"] = { L"冯平乒甹评呯岼泙坪苹凭郱枰玶胓洴屏帡庰俜荓砯涄娉瓶硑屛帲淜萍蚲缾馮蛢聠評塀艵甁焩幈蓱軿鲆竮凴慿箳頩憑鮃檘簈" };
			table[L"po"] = { L"叵朴廹钋迫尀坡泼泺岥岶泊敀珀昢洦釙砶破烞哱钷颇笸翍粕婆奤酦湐猼鉕蒪嘙鄱頗魄搫蔢箥潑髲駊醗皤繁濼櫇嚩醱覇鏺" };
			table[L"pou"] = { L"抔抙咅剖哣娝捊垺婄掊棓犃裒箁" };
			table[L"pu"] = { L"仆攵攴圤扑朴炇抪陠匍巬柨莆捗浦圃埔烳菩铺痡秿普堡葡菐溥圑蒱蒲酺僕谱暜箁噗舗獛撲鋪墣暴舖潽諩氆璞擈樸镤镨瞨穙檏濮鯆瀑譜贌蹼曝纀鏷鐠" };

			table[L"qi"] = { L"七丌乞亓气邔讫企伎芑迄迉岂屺扱汔忔気祁齐芪芞弃启呇呚岐岓沏汽圻忯杞玘盀矵其亟亝奇呮妻泣炁枝祈祇斉肵歧盵畁俟契咠洓恓柒竐疧砌凄剘郪陭倛唘旂耆栖桤栔氣欫斊脐竒蚑蚔蚚豈訖起颀萋萁萕帺啐啓啟唭啔骐骑娸婍猉崎捿掑淇淒绮埼悽焏戚桼梩畦袳軝跂釮隑葺喰嵜揭湆湇缉夡愒棋棨棄棊棲敧欺欹晵祺琪琦期攲蛴紪傶滊愭稘锜碕碁褀褄鬿頎僛嘁摖漆墄慽旗榿暣甈碶蜞蜝粸綦綮綺綥綨緀齊蕲噐槭禥璂慼憇稽緝觭趞踦器憩碛磜磧磩螧螇諬錡鲯霋鄿薺藄藒濝懠魌檱櫀臍簯簱鳍騏騎蘄礘蟿罊鏚闙麒鵸鶀鶈鯕蠐艩籏鐑鬐騹鰭玂麡" };
			table[L"qia"] = { L"卡圶冾匼拤抲洽胢恰峠咭帢掐殎硈袷揢愘葜酠跒擖磍髂" };
			table[L"qian"] = { L"凵千欠刋阡仟仱伣芊迁奷扦汘纤圱圲佥芡茾岍岒扲汧忴杄拑浅欦玪肷钎臤乹前俔荨茜拪炶牵钤倩唊挳悭悓歬铅钱钳蚈蚙虔谸乾偂婜掮揵掅淺堑孯牽軡釺傔亁谦葥媊嵌椠棈犍欿掔朁鈆鈐僉蒨遣嗛骞嵰慊煔愆皘鹐签鉗鉛蔳摼撁墘塹慳槏榩歉搴膁蜸綪箝銭厱儙谴蕁遷撍潜潛槧磏篏諐鳽羬缱橬褰篟輤錢黔嬱壍縴謙顅黚檶騝攐攑濳櫏繾簽騚鵮孅攓譴騫灊籖鰬鬜鬝籤韆" };
			table[L"qiang"] = { L"羌抢呛矼玱枪斨炝戕戗羗唴猐啌強羟跄椌强腔溬獇嗴搶蜣锖羥嗆蔷锵瑲牄槍羫摤嫱嶈摪墙墏戧熗蔃樯漒彊墻薔嬙廧篬牆蹌謒繈襁镪檣繦蹡鎗艢鏘疆蘠鏹鶬羻" };
			table[L"qiao"] = { L"丂巧乔壳侨陗俏诮荞荍峤帩峭悄桥窍郻偢菬殻硗硚釥雀喬愀殼睄翘鄡鄥喿嵪跷劁勪僑谯幓槗敲摮毃锹誚踍髚僺蕎嘺嫶嶠撬潐墝墧憔碻磝箾鞒骹頝幧噭撽缲墽燋燆橇樵橋犞鞘韒橾瞧癄磽礄鍫鍬礉竅繑翹鞩髜藮櫵繰譙趫趬蹻蹺鏒躈鐈鐰鞽顦" };
			table[L"qie"] = { L"切且癿伽苆厒怯妾疌茄郄契窃砌匧洯挈栔悏惬笡淁帹愜跙趄蛪猰椄嗛慊锲稧朅箧篋踥穕鍥鯜聺籡竊" };
			table[L"qin"] = { L"芹芩忴坅庈沁吣吢抋扲肣昑侵矜钦亲骎衾笉耹蚙矝秦菦珡埐唚梫捦菣赾菳覃媇锓禽琹琴欽寑鈙鈫揿雂嵚寖嫀勤嗪寝綅靲嵰搇溱慬寢誛廑噙鳹嶜嶔鋟擒撳斳檎親螓瘽澿懄螼顉駸懃蠄鮼寴鵭藽瀙" };
			table[L"qing"] = { L"庆顷青靑夝苘甠氢轻亲剠请凊郬卿勍倾庼掅啨殸氫寈硘殑情清圊淸埥頃葝軽晴氰渹棾碃暒傾綪綮蜻箐輕廎靘請慶擏漀樈錆鲭檠親擎磬罄儬濪檾謦櫦鯖黥鑋" };
			table[L"qiong"] = { L"卭邛宆穷穹茕桏赹琁筇惸笻焭焪琼舼蛬蛩煢熍跫睘銎瞏窮憌璚橩嬛儝藑竆瓊藭瓗" };
			table[L"qiu"] = { L"仇厹丘玌囚扏犰叴芁艽丠朹汓肍虬求邱龟坵虯牫泅觓恘酋訅秋秌俅訄恷釚紌莍唒浗逑逎赇殏頄毬梂釻蚯球崷皳媝盚巯遒湫萩渞湭絿蛷裘煪楸湬搝蓲塸巰觩賕鹙璆銶蝤蝵篍緧糗鼽醔趥穐龜鮂橚鳅鞦鯄鞧蟗蘒鶖鰌鰍龝蠤鰽" };
			table[L"qu"] = { L"区去厺佢曲刞匤阹劬佉伹诎苣驱岖取呿岴屈抾坥浀斪欪祛胠朐胊菃竘鸲袪衐區娶渠淭焌蛆蚼耝紶絇翑躯葋阒煀蛐粬筁軥詘詓趋趍蕖嶇憈竬駆觑敺璖蝺麹誳趣閴駈螶磲髷麮鴝魼璩蟝翵趨龋闃麯鼁瞿覰覷軀鼩蘧麴鶌黢覻忂灈驅戵爠氍欋臞籧鰸鱋癯欔蠷齲衢躣蠼鑺鸜" };
			table[L"quan"] = { L"犭劝犬犮权全券狋奍佺诠峑恮洤泉荃姾弮畎烇牷辁牶拳悛绻惓圈埢硂捲铨痊婘啳絟筌犈椦棬圏湶葲跧詮觠輇勧瑔搼銓蜷綣箞踡韏権槫駩醛縓鳈鬈勸騡孉鐉巏鰁齤權矔蠸虇颧顴灥" };
			table[L"que"] = { L"汋却炔卻缼蚗缺埆崅雀悫琷硞确傕敪敠阕棤蒛阙碏鹊皵塙搉愨榷碻確慤趞墧瘸燩闋礐闕鵲礭" };
			table[L"qun"] = { L"夋囷逡帬宭峮裙群裠羣箘踆歏麇" };

			table[L"ran"] = { L"冄冉苒呥姌肰染袇衻珃袡蚦蚺然媣蒅髥熯嘫髯燃橪繎" };
			table[L"rang"] = { L"让壌穣儴勷懹譲壤瀼攘獽嚷蘘爙禳瓤穰纕讓躟鬤" };
			table[L"rao"] = { L"扰荛娆饶绕桡隢蕘遶嬈橈穘襓擾繞饒" };
			table[L"re"] = { L"若热喏捼渃惹熱" };
			table[L"ren"] = { L"人亻刄刃仁认壬仞仭讱任忈朲屻纫牣韧杒轫纴饪忍妊忎肕秂芢祍姙荏衽紉栣栠荵訒軔紝梕釼釰袵秹菍靱靭韌飪絍鈓棯腍稔魜銋認餁鵀" };
			table[L"reng"] = { L"仍辸扔礽芿陾" };
			table[L"ri"] = { L"日驲囸氜衵釰釼鈤馹" };
			table[L"rong"] = { L"冗宂戎坈肜绒茸荣茙栄狨容峵毧傇烿絨軵羢傛搑媶嵘搈蓉嵤嫆溶榵瑢穁榮榕熔槦縙蝾褣镕穃氄融螎駥嬫嶸爃鎔瀜蠑曧" };
			table[L"rou"] = { L"禸厹肉宍柔粈脜葇媃揉渘腬瑈楺煣蝚糅輮蹂鍒鞣韖瓇騥鶔鰇譳" };
			table[L"ru"] = { L"入女邚杁如汝吺肗乳侞茹帤洳桇挐辱袽铷鄏筎渪媷蓐蒘缛溽嗕銣蝡蕠褥鴑縟儒鴽濡孺擩嶿獳嬬嚅薷曘檽襦蠕繻颥醹顬鱬" };
			table[L"ruan"] = { L"阮软朊耎偄軟媆堧瑌腝碝撋緛輭壖瓀檽礝" };
			table[L"rui"] = { L"兊兑芮兌汭抐苼枘笍蚋桵惢锐甤瑞蜹睿緌銳鋭蕋蕊蕤橤叡繠蘂壡蘃鏸" };
			table[L"run"] = { L"闰润閏閠潤橍膶瞤" };
			table[L"ruo"] = { L"叒若偌弱鄀渃焫捼婼楉嵶蒻箬篛爇鰙鶸鰯" };

			table[L"sa"] = { L"卅仨钑泧飒洒訯脎鈒萨靸馺摋蕯颯潵鞈撒薩攃櫒鏾灑躠纚" };
			table[L"sai"] = { L"思毢揌愢塞毸腮嘥赛僿噻賽鳃顋簺鰓" };
			table[L"san"] = { L"三仐伞弎参叁俕參帴叄叅閐散傘毵毶厁糁毿犙潵馓糝糣糤繖鏒鏾饊鬖" };
			table[L"sang"] = { L"丧桒桑喪嗓搡槡磉褬颡鎟顙" };
			table[L"sao"] = { L"扫梢掃掻埽嫂慅溞搔骚缫瘙缲螦懆臊氉繅鳋矂颾騒繰騷鰠髞鱢" };
			table[L"se"] = { L"色拺洓涩栜粣啬铯渋雭歮琗塞瑟嗇閪歰銫摵槭澁懎濏濇薔擌穑瘷廧璱澀穡鎍瀒繬穯轖鏼闟譅飋鱪" };
			table[L"sen"] = { L"森椮槮襂" };
			table[L"seng"] = { L"僧鬙" };
			table[L"sha"] = { L"杀杉纱沙乷刹剎砂粆莎倽唦殺紗猀啑桬铩唼啥帹萐菨痧硰厦喢煞翜傻蔱廈嗄摋歃裟歰榝翣箑魦鲨濈閯儍樧閷霎髿鎩鯊鯋繺" };
			table[L"shai"] = { L"晒筛摋篩諰簁簛攦曬籭" };
			table[L"shan"] = { L"山彡邖讪闪汕删刪芟杉陕单苫姗姍钐疝衫陝狦挻埏炶栅柵珊舢剡扇脠痁軕訕赸閃閄掺掸掞笘釤傓善單椫晱禅跚剼骟搧煔睒銏鄯僐幓嘇摻煽熌儃撣潸澘潬缮墠墡覢嬗嶦擅樿敾歚禪膳穇赡檆膻磰縿謆鯅蟮繕羴蟺羶贍譱鐥饍鳝騸鳣灗鱓鱔" };
			table[L"shang"] = { L"丄上伤汤尙尚恦垧殇扄晌绱商埫愓觞赏湯傷禓慯緔蔏滳漡墒熵樉殤賞鋿螪鞝觴謪鏛鬺贘鑜" };
			table[L"shao"] = { L"勺少召芍邵卲劭佋杓苕绍玿柖烧袑捎娋莦哨弰紹梢睄稍萷焼綤旓艄筲輎韶潲燒鞘髾鮹" };
			table[L"she"] = { L"设厍舌佘社折泏舎舍厙虵挕拾奓射涉蛇赊赦設涻渉奢猞捨弽蛥揲畭畲畬滠輋摄摂慑慴賖賒蔎歙闍檨磼蠂韘騇麝懾灄攝欇" };
			table[L"shei"] = { L"誰" };
			table[L"shen"] = { L"什申邥屾扟伸弞吲抌沈身冞罙侁参诜呻审妽绅肾矤籶信侺哂姺柛氠昚神珅胂甚矧穼籸谂谉莘娠峷涁眒眘甡砷參叄婶深渗淰渖堔敒祳脤紳訠叅葚葠棯腎裑兟訷蓡嫀搷慎愼椹榊瘆罧蜃蜄詵鉮蔘幓滲甧糁審糂諗鋠頣魫薓燊曋瘮鲹駪曑瞫糝嬸瀋糣鵢鯓鯵黮覾讅鰺" };
			table[L"sheng"] = { L"升生圣阩甸斘呏声枡苼昇泩狌殅乗牲珄娍胜竔省陞晠晟曻眚乘陹笙剰绳盛渑殸偗焺甥剩勝渻湦貹椉鉎嵊琞聖榺墭憴縄澠蕂橳聲繉賸鍟繩鼪譝鵿" };
			table[L"shi"] = { L"十尸饣士什氏礻世丗仕辻失市史石矢示乨似卋师忕式亊佦识忯戺时竍豕事厔邿势使侍诗试呞呩驶实実始饰泽视柹旹鸤虱飠兘冟适咶室宩姼狮狧峙峕屎屍拾拭浉恃恀贳施炻栅柿枾昰是祏眂蚀食莳逝師宲狶埘轼烒耆栻時铈眎眡舐匙啫埶秲痑硕畤絁笶釈視釶谥葹徥遈寔崼崻揓湿湜湤惿弑殖貰释勢蒒蓍蒔嗜獅嵵溼溡溮塒弒煶楴睗筮軾觢試詩鈰鉂鉃鉇鉐飾適嘘實榯瑡碩蝕舓誓酾鉽馶鳲奭噓蝨箷銴餝餙鲥駛鳾遾噬嬕澤澨褷諡諟鲺鮖濕檡螫謚鍦簭鼫籂識鯴鼭襫釋醳鰘鶳鰣鰤襹釃" };
			table[L"shou"] = { L"扌収手收守寿受首垨狩敊兽授涭绶售痩膄壽綬瘦夀嘼艏獣獸鏉" };
			table[L"shu"] = { L"书殳术朮疋尗戍朱抒纾忬束鼡陎叔述沭枢杸俞侸兪荗咰姝树怷怸竖倏倐捈捒殊恕書秫紓鄃隃菽蒁庶庻婌掓淑孰焂梳悆絉術軗尌属赎暑暏琡稌疏疎裋舒黍蒣摅输毹毺数腧竪署蜀綀鉥鼠漱潄塾墅瑹跾踈蔬澍潻熟樞數緰豎薯薥濖樹輸錰霔橾曙鮛儵藷攄璹癙襡瀭糬鏣鵨鶐襩屬籔蠴贖虪" };
			table[L"shua"] = { L"刷耍唰誜" };
			table[L"shuai"] = { L"帅甩帥衰率缞摔縗蟀卛" };
			table[L"shuan"] = { L"闩拴閂栓涮絟腨槫" };
			table[L"shuang"] = { L"双泷爽漺塽慡縔霜雙骦灀瀧孀孇騻欆鹴礵鷞艭驦鸘" };
			table[L"shui"] = { L"氵水氺说谁涚涗挩捝帨祱娷脽税稅裞睡説說誰" };
			table[L"shun"] = { L"吮顺眴舜順楯蕣橓瞚瞤瞬鬊" };
			table[L"shuo"] = { L"妁洬烁说铄朔硕欶矟蒴数搠銏碩説說愬槊獡數箾鎙爍鑠" };
			table[L"si"] = { L"厶纟巳亖丝司四似寺汜死糸糹兕伺佀姒泤祀私価咝驷饲泗泀孠杫俟俬娰洠枱柶牭思食涘洍恖鸶虒肂飤偲梩耜耛笥釲傂媤缌愢斯竢蛳絲覗嗣飔楒禗肆貄鈶鈻鉰飼飴凘厮榹禠锶罳蜤銉蕬廝嘶噝撕澌禩磃緦鋖駟蕼燍螄儩鍶騃瀃蟖蟴簛颸騦鯣鐁鷥鼶" };
			table[L"song"] = { L"讼吅宋忪松枀枩怂诵送柗娀耸悚捒凇倯淞梥訟崧庺菘竦颂棇愡揔硹傱頌嵩楤愯摗嵷漎誦慫憽濍檧聳餸駷鬆" };
			table[L"sou"] = { L"凁叟叜捜捒鄋欶傁蒐棷溲搜蓃馊獀嗖廋廀摉飕嗽嗾摗瞍锼撨艘螋擞瘶薮醙鎪餿擻藪颼颾櫢鏉騪籔" };
			table[L"su"] = { L"玊圱夙诉苏泝肃俗洬速素涑珟莤粛埣殐梀宿骕棴訴甦酥粟傃谡嫊稣稡嗉鹔窣遡肅愫溯塐塑溸觫缩蔌遬僳趚愬摵榡膆餗鋉碿樕樎潥憟穌潚縤縮璛簌藗謖橚鯂蹜蘓蘇櫯囌驌鷫鱐" };
			table[L"suan"] = { L"狻祘笇痠蒜筭算酸匴篹" };
			table[L"sui"] = { L"夊亗岁芕尿虽砕倠谇荽荾绥祟哸浽娞眭埣隋随嵗遀遂碎睟睢歳歲綏毸煫滖缞隧隨嗺熣誶賥嬘澻穂鞖濉膸燧璲禭縗檖穗雖繀襚邃穟瀡髄繐繸瓍旞譢鐆鏸鐩髓韢" };
			table[L"sun"] = { L"孙扻荪狲隼损笋孫飱喰飧筍蓀搎損猻摌榫槂箰蕵薞簨鎨鶽" };
			table[L"suo"] = { L"些所莎莏逤唆唢索娑挱梭桫挲琐琑傞惢嫅锁睃暛羧嗍蓑嗦嗩溹溑瑣獕摍褨蜶缩趖璅縒簑簔縮鎖鎻鎍鮻鏁" };

			table[L"ta"] = { L"他它她牠祂拓沓闼狧挞趿粏铊涾崉塔溚傝嗒搨阘鉈溻遢塌遝榙禢榻墖漯毾澾撻鞈褟誻踏橽錔嚃獭鞜蹋鮙濌闒鳎鎑鎉鞳蹹獺闟闥嚺譶鰨躢" };
			table[L"tai"] = { L"大太冭夳台忕汏邰忲汱汰旲抬骀态肽坮囼苔孡珆胎枱钛炱炲舦泰酞菭奤跆鈦鲐溙態颱臺箈駘儓鮐燤薹嬯擡檯斄籉" };
			table[L"tan"] = { L"叹忐坛坍昙贪坦怹炭倓袒钽郯谈啴舑痑貪菼惔埮弹婒探湠覃傝毯弾鉭榃摊僋滩锬痰嗿谭碳嘆緂舕彈瘫儃嘽嘾歎談墰潭墵潬憳憛醈橝醓壇錟澹憻燂暺曇顃璮檀罈襢藫擹繵譚壜醰貚譠罎灘攤癱" };
			table[L"tang"] = { L"伖汤坣帑倘烫唐铴偒堂淌鄌棠愓湯啺傏傥搪嵣溏隚蓎塘膅瑭禟榶耥煻漟嘡摥糃劏蝪躺磄镋羰趟膛樘橖镗踼薚螗燙糖篖糛醣赯螳餹蹚鎕鎲饄鏜闛鞺鐋鶶儻灙戃爣鼞曭矘钂" };
			table[L"tao"] = { L"讨夲叨夵迯抭弢匋洮逃咷涛绦桃套討陶绹涭梼萄掏淘啕詜絛祹搯跳裪幍慆嫍滔槄瑫韬蜪綯鞀飸鞉醄駣鋾縚縧謟轁濤饀檮騊鞱韜鼗饕" };
			table[L"te"] = { L"忑忒特犆铽貸慝鋱蟘" };
			table[L"teng"] = { L"疼痋幐腾誊漛熥邆滕駦膯螣縢謄藤儯霯騰籐鰧籘虅鼟驣" };
			table[L"ti"] = { L"戻体弟屉奃苐剃厗眣挮逖桋倜俶剔悌绨涕珶屜掦惕梯笹悐偍逷啑罤题躰崹鹈锑稊替惖徥棣惿提揥渧媂媞啼屟缇禔裼綈嗁瑅褅睼骵碮褆踢緹銻殢髰蕛徲歒漽磃薙醍趧蹄謕鬀擿蹏嚏鍗鳀鵜鬄題鮷瓋嚔騠鶙鯷籊鶗軆鷉鷈趯體禵鷤" };
			table[L"tian"] = { L"天田奵兲佃甸呑屇忝沺畋殄恬胋盷畑钿倎栝铦甛甜紾悿菾唺淟添婖掭晪琠靔酟腆湉觍阗痶睓搷填塡碵餂舔瑱緂銛磌銽覥賟窴錪黇璳闐靝舚鷆鷏" };
			table[L"tiao"] = { L"芀朷旫条迢佻岧岹苕祒庣宨挑恌朓祧晀條脁笤啁粜萔铫眺窕絩蓚聎覜誂趒跳蓧蓨龆銚樤蜩調窱鋚斢鲦鞗髫嬥鯈鎥齠鰷糶" };
			table[L"tie"] = { L"帖呫怗贴铁萜蛈聑跕貼鉄飻僣銕餮鐵驖" };
			table[L"ting"] = { L"厅邒圢汀庁忊廷甼庍町听耓侹厛烃涏挺娗庭莛亭侱脡珽梃烶铤桯烴停渟颋筳艇綎蜓葶婷嵉誔楟榳霆閮鋌濎頲聤蝏諪鞓聴聼鼮廰聽廳" };
			table[L"tong"] = { L"仝同佟囲彤侗庝峂统垌峝峒恸狪炵哃茼烔砼桐晍捅浵蚒通秱铜偅眮痌桶筒痛絧統童硧粡衕鉖酮詷赨筩綂蓪嗵勭鲖餇鉵銅僮慟樋獞潼憅燑氃橦犝曈膧朣瞳穜鮦" };
			table[L"tou"] = { L"亠头投妵紏透偸偷埱愉敨婾媮飳骰斢緰鋀頭黈鍮蘣" };
			table[L"tu"] = { L"土圡凸汢吐兎禿秃図迌宊兔钍怢图凃突涂唋悇徒途莵荼涋庩捈峹捸屠堍梌釷菟啚稌葖痜趃堗湥揬鈯蒤塗腯嵞筡瘏摕廜跿酴嶀潳瑹圖圗鋀鋵墿馟鍎檡駼鵌鵚鵵鶟鷋鷵鼵" };
			table[L"tuan"] = { L"团団抟彖猯揣湍湪煓圕剸團褖畽慱塼漙摶墥槫貒疃篿檲鏄糰鷒鷻" };
			table[L"tui"] = { L"弚忒弟侻退俀娧聉推颓蛻蜕腿煺隤僓蓷尵墤橔蹆頽骽頹頺藬駾魋穨蹪蘈讉" };
			table[L"tun"] = { L"屯氽坉芚忳囤饨呑吞庉旽涒啍豘豚軘蛌飩鲀朜焞褪魨憞噋霕黗暾臀臋" };
			table[L"tuo"] = { L"乇阤仛讬汑扡托饦驮彵杝杔妥陁陀佗咜坨沰沱沲拕拖拓侂岮狏驼咃侻柝柁莌袉袥砤砣鸵铊託毤捝挩啴飥脫脱紽庹萚唾涶詑椭跎酡媠堶跅馱馲碢楕毻箨槖撱嶞駄嫷魠駞駝橢鋖橐鴕鮀鵎鮵鼧騨蘀鰖鼍籜驒驝鼉" };

			table[L"wa"] = { L"瓦屲凹佤穵邷呙咓劸帓咼洼砙挖徍哇娃娲袜窊畖瓸唲聉啘媧婠窐瓾嗢嗗蛙溛腽搲韎膃窪漥鮭鼃襪韈攨韤" };
			table[L"wai"] = { L"外呙咼歪喎崴竵瀤顡" };
			table[L"wan"] = { L"万丸毌卐卍夗夘刓芄纨汍完妧岏抏忨玩宛杬紈弯唍顽蚖挽捖盌莬剜倇莞菀帵惋烷梚晚晥脘脕貦萖捥涴婉婠绾埦椀皖腕塆惌湾琬掔晼晩萬絻畹綄碗睕頑綰輐輓箢綩蜿蔓潫澫鋔翫槾鋄踠豌瞣錽鋺薍蟃贃鎫贎彎灣壪" };
			table[L"wang"] = { L"亾兦亡王尣罓罒网仼妄尪忘忹尫汪抂迋彺徃罔往盳枉旺尩迬徍蚟莣菵朚望惘暀棢辋蛧朢蝄網輞誷瀇魍" };
			table[L"wei"] = { L"卫囗为厃韦未伟伪圩危位苇芛违帏闱尾沩纬围囲苿味委炜玮隹威峗峞洈洧為胃畏韋倭诿叞荱娓捤涠浘烓桅軎隗隈隇偎偽偉谓萎菋逶尉帷唯唩猚崣捼维惟梶痏硊硙骩葳蒍葦葨徫違廆幃喂喡喴媦媁媙猥猬崴嵬嵔揻揋湋渭溈渨圍愄愇琟爲骫骪微溦煨煒煟椳椲楲暐瑋韪腲痿艉詴鄬僞蔚蓶嶉撱潍墛瞆磈碨蜼蜲維鲔蔿寪撝潿潙熭犚慰磑蝟蝛緯緭覣諉醀踓韑頠衛薇薳嶶懀罻謂餧鮇衞儰濰濻燰螱褽鍏鍡闈餵鳂魏鮠鮪藯瀢壝矀癐癓轊颹韙鏏鳚霨韡蘶巍覹鰃鰄犩饖霺亹欈瓗讆躗讏躛斖" };
			table[L"wen"] = { L"文刎问伆吻呅忟芠纹妏彣抆汶歾玟忞肳炆呡闻昷蚊蚉紊紋莬珳脗桽問阌渂雯塭揾缊温榅絻搵殟辒溫韫瑥稳榲駇馼聞瘒瘟鳼鴍緼魰螡縕輼豱閿閺鼤鳁饂闅鎾轀蟁穏鞰顐繧穩璺鰛闦鰮" };
			table[L"weng"] = { L"瓮翁勜奣蓊塕滃嵡嗡暡瞈鹟螉聬蕹甕鎓攚罋鶲齆" };
			table[L"wo"] = { L"仴沃呙肟我咼卧枂臥挝莴涡倭渦涹涴捾捰唩萵偓婑婐猧媪握喔渥媉窝幄焥硪蜗媼窩腛楃瞃斡濄撾蝸緺踒瓁臒薶濣龌馧龏齷" };
			table[L"wu"] = { L"乄兀亡乌无勿五午毋阢务戊邬伍仵弙屼扤扝扜污汙汚圬芴芜迕巫庑呜吾吴吳呉妩岉沕坞怃忤杌杇杅於物旿玝忢武矹郚侮俉诬误屋洿卼柮敄钨陚務倵茣莁逜唔娒娪峿捂浯洖悟悮悞烏恶粅趶剭啎娬焐梧牾晤祦珸窏釫隖鄔骛婺嵍渞堥無珷惡铻痦鹀靰奦嗚嵨摀溩塢鹉碔蜈誈雾雺僫寤舞熃熓歍瑦鹜誣誤蕪廡嫵潕墲憮箼鋈鋙鋘儛橆甒璑膴窹螐瞴霚鴮鼿蟱鎢霧鵐鯃齀蘁譕騖鵡鶩鼯躌鰞鷡" };

			table[L"xi"] = { L"匸习夕兮邜卌吸扱扢汐忚戏西希屃饩扸忾系卥郋郄呬细怬析杫昔忥肸肹钑矽穸郗郤係俙诶徆咥咭饻洒洗恓恄枲欪怸盻莃奚席唏娭狶屖屓浠绤悕栖牺氥欯息玺菥徙唽阋淅渓惜烯焁焈觋桸欷晞琋悉铣硒細習赥釳釸雭袭羛隙鄎傒葸葈喜喺摡塈焟焬椞犀晰晳惁腊稀睎舄舃粞翕翖舾趇鈢隟厀蓆蒠蒵徯媳嵠溪滊愾慀煕椺禊皙锡碏裼綌赩鉨鉩僖蓰獡嶍屣漇漝墍熙熈熄熂榽犔稧蜥緆覡豨誒趘銑餏蕮嘻噏嬉嬆潝潟澙憘戯槢膝瘜磎覤凞隰薂熹戱熺熻樨橀橲歙歖暿禧憙窸螅螇縘諰錫黖羲壐戲燨檄犠瞦磶礂蟋縰谿豀豯謑貕蹊鳃巂嶲蟢虩糦繥釐謵蹝鎴餼雟鬩鵗隵璽繫觹譆醯鏭鐊鳛霫酅嚱巇爔犧曦闟饎飁騱騽瓕觽霼鰼襲鱚鼷囍屭矖蠵鸂衋纚觿躧鑴驨" };
			table[L"xia"] = { L"丅下芐吓夹匣夾狎侠呷疜峡狭炠柙俠疨陜虾烚珨夏埉祫狹峽捾谺笚舺翈唬硖陿厦閕硤傄徦遐舝颬筪廈閜煆敮暇瑕瘕碬睱辖諕蝦磍瞎蕸縖魻螛赮嚇霞鍜懗轄罅鎋鎼夓黠鏬騢鰕鶷" };
			table[L"xian"] = { L"彡见仚仙屳先奾纤伭佡县苋闲岘忺氙見冼限苮弦咁妶狝线贤现杴欦祆秈臤臽险陥咸唌宪姺姭挦洗涎枮显玹胘盷県籼陷険莶莧哯娴娊猃峴崄涀垷烍毨珗蚬軐娹婱馅掺掀埳現晛铣铦硍蚿絃衔舷赻羡啣湺缐睍痫鹇蛝絤綖筅閑閒羨嗛嫌搚搟溓塪尠尟献禒腺锨蜆粯綅酰跹跣僊僩僲僴嘕摻槏甉綫誢銜銑銛鲜險嫻嫺撏撊澖憪暹稴線箲賢誸銽鋧韯羬薟嬐獫嶮憸橺橌憲縣輱諴醎鍁錎餡藓獮壏懢瞯癇癎褼繊豏鍌韱鮮藖燹顕麲幰攇瀗臔蹮馦蘚廯孅攕櫶獻礥糮譣醶鏾霰鹹麙纎贒鶱玁襳躚纖韅顯鷼鷳鷴鼸灦鱻" };
			table[L"xiang"] = { L"乡夅向羊芗瓨佭享详蚃姠相响饷庠香亯巷项羏祥珦栙郷晑厢啍象鄊鄉缿絴翔飨項衖鄕缃湘葙萫廂跭勨像詳想嶑潒鲞餉閧銄銗薌橡曏膷箱緗襐闂蠁蟓鮝嚮襄鯗鐌勷儴忀饗骧響麘瓖欀镶鱌纕鱶饟鑲驤" };
			table[L"xiao"] = { L"小灱灲孝肖効呺枭削俏侾哓咲骁姣洨恔枵郩俲莦逍庨哮宵宯消涍绡烋校效晓鸮虓笑萧啸婋猇崤淆焇梟訤傚敩暁殽销睄痚痟硝硣窙翛嗃揱蛸綃筱筿詨箫嘐嘨嘋潇熇歊誟踃嘵獟獢撨憢皛箾誵銷霄骹蕭薂彇嘯曉膮篠謏颵魈鴞藃熽歗皢穘蟏蟂簘鴵嚣瀟蟰簫髇櫹斅斆囂嚻髐鷍蠨驍毊虈" };
			table[L"xie"] = { L"写叶邪劦协旪伳灺些協泄泻绁祄胁缷卸契奊峫挟拹洩垥恊炧炨枻卨娎屑挾栧脇脋脅衺偕偰偞谐徢禼焎斜烲械梋紲亵谢媟猲屟揳渫絜絏絬翓颉僁嗋携搚滊塮慀愶楔歇瑎綊解觧觟冩熁榭榍榝膎褉鲑靾勰噧寫獦屧撷擕缬樧暬碿蝎蝢緳縀緤鞋薤薢邂廨獬嶰澥懈糏諧韰燮燲褻謝鮭藛嚡擷瀉夑鞢韘瀣爕蟹蠏蠍繲鞵齘儶襭齛孈攜纈齥齂躠躞讗龤" };
			table[L"xin"] = { L"忄心阠邤囟伩伈辛芯妡孞忻昕枔杺炘欣信盺軐莘俽惞衅訫訢脪愖鈊锌焮歆新馸鋅廞薪嬜噷噺镡襑顖舋鐔馨礥鑫釁馫" };
			table[L"xing"] = { L"刑邢兴行饧陉杏形巠狌性姓幸郉侀哘钘省星陘型洐荥荇倖垶骍娙莕涬铏悻硎婞葕惺鈃猩蛵煋腥瑆睲滎鉶銒緈觪鋞篂箵鮏醒謃興觲擤曐餳騂皨嬹鯹臖" };
			table[L"xiong"] = { L"凶匂兄匈兇讻芎汹忷诇洶哅恟胷胸訩雄詗焽焸詾敻熋熊夐賯" };
			table[L"xiu"] = { L"休朽秀峀岫俢苬咻庥修脩珛烌绣羞袖臭鸺宿脙琇锈臹潃溴滫馐貅綉嗅樇髤銝褎褏璓糔銹螑髹嚊繍鎀鮴鵂鏅饈繡鏥鏽鱃齅飍" };
			table[L"xu"] = { L"邪休许吁圩戌旭伵芧序汿旴卹侐诩呴姁妶怴沀盱疞俆叙浒洫恤恓欨昫朐胥砉须冔徐垿殈烅栩欰晇珝珬眗畜訏顼勖勗偦谞喐掝淢绪续惐烼敍敘裇蚼虚虗許酗喣媭婿壻揟湑溆湏欻朂矞蛡聓虛絮訹須蓄蒣滀慉煦楈暊禑綇続賉詡頊鄦蓿蓲嘘滸漵潊墟槒稰盢瞁聟緒銊需魆蕦嘼噓嬃獝歔稸蝑糈緰緖縃藇歘諝諿醑盨藚燸譃魖續驉鑐鬚鱮" };
			table[L"xuan"] = { L"玄吅伭县轩券昍怰泫妶选炫绚咺昡玹宣痃铉眩烜軒弲晅袨琁眴琄梋衒旋谖悬塇愋愃萱渲萲揎媗喛喧絢蜁瑄暄鉉暅楥楦煊蓒夐嫙碹睻漩蔙敻翧暶蝖箮選儇鋗璇禤縣諠諼懁蕿镟颴鞙嬛駨鍹縼檈駽璿繏癣翾蠉鏇蘐藼矎譞懸讂癬贙" };
			table[L"xue"] = { L"彐穴血吷斈坹怴学泬岤峃狘茓乴泶疦削袕鸴桖疶谑雪蒆敩靴滈趐踅膤樰學謔辥壆薛噱嶨燢辪瞲澩轌瀥鞾鳕觷鱈鷽" };
			table[L"xun"] = { L"卂讯训廵伨巡迅寻驯汛孙旬坃杊郇侚询畃勋荀徇逊迿咰姰狥峋浔洵巺恂紃浚埙孫殉毥栒桪珣訊訓訙偱奞焄眴勛循尋揗巽殾稄遜塤煇詢馴鄩熏愻窨鲟勲蕈噀噚潠潯勳薫燖燅樳璕攳駨薰嚑獯濬壎燻曛臐蟫蟳蘍矄壦爓爋纁醺顨鶽鑂鱏鱘灥" };

			table[L"ya"] = { L"丫劜牙圠轧疋圧邪吖讶伢覀亚厊压冴襾庌犽岈呀迓芽亜厑庘玡軋枒亞厓押拁姶垭疨鸦挜砑娅哑鸭蚜笌唖琊氩俹桠痖铔埡訝婭崖崕掗涯猚啞堐孲釾雅聐猰揠氬椏椻衙圔稏瘂睚窫漄碣潝蕥鴉磍錏鴨壓鵶齖鐚瓛齾" };
			table[L"yan"] = { L"讠厌延夵闫严芫妍妟抁沇觃言訁乵郔兖奄岩沿炎炏牪昖匽俨兗莚弇咽唌姲姸娫狿彦彥洝埏恹研砚衍剡唁验宴娮烟烻梴晏殷珚胭铅盐艳覎厣郾隁偃偐谚菸萒啱阉阎猏崦掞掩淹淊焉焔琂眼硏訮酓閆隒遃喭喦嵒嵃嵓揜湮渰渷堰愝殗扊焰焱棪敥猒晻琰腌硯蜒綖筵雁鄢傿滟溎塩煙椻椼楌歅揅硽罨裺詽鳫厭蔅嫣嵼演漹墕熖暥碞褗酽鳱谳嬊嶖戭窴蝘醃餍魇鴈颜羬厳噞嬐赝燕燄橪虤躽諺閹閻閼鬳嚈嬮懨檐曕縯篶鴳酀檿懕顔顏騐験黡厴嚥嚴嬿巌壛艶簷贋爓櫩曣甗臙醶騴鶠鰋黤齞儼鷃黭黬黫龑孍巖巗灔壧贗顩黰鼴囐巘巚曮觾讌醼饜魘驗鷰鼹礹艷鹽齴灎釅驠黶灧豓讞豔麣灩" };
			table[L"yang"] = { L"卬央羊扬仰阳阦玚杨旸佒炀飏氜怏坱钖泱疡抰岟佯详劷姎咉垟羏炴殃柍胦徉洋昜养样鸯氧珜烊恙秧眏紻眻痒羕陽揚崸崵蛘愓婸軮詇楧傟勜鉠敭飬雵蝆氱锳慃瑒煬楊禓暘漾瘍様鞅養樣駚鍈諹輰鴦鍚懩鴹瀁攁颺癢鰑霷鸉" };
			table[L"yao"] = { L"么幺夭爻仸吆约尧宎妖岆匋侥苭狕抭尭怮殀杳枖祅肴疟药咬姚峣垚恌轺柼钥穾約要倄烄烑珧皋眑窅窈袎舀隃偠皐铫窕窑窔訞傜谣葯葽喓婹崾揺堯殽筄軺詏蓔徭遥遙嗂媱猺摇搖滧溔愮楆腰僥摿飖熎榚榣暚瑶瑤覞銚餆靿瘧徺獟嶢嶤鹞磘窯窰箹鴁薬邀撽餚鴢鼼繇謡謠闄藥燿曜艞鎐鳐矅颻騕蘨耀邎纅顤鷂鰩齩鷕鱙讑" };
			table[L"ye"] = { L"也业叶页曳爷吔邪亪冶曵邺夜抴耶亱枼捓拽頁咽峫倻枽烨捙射晔液焆埜谒野铘揶掖椰釾爺葉殗喝堨揲腋瑘業楪暍痷煠墷馌燁僷鋣嘢窫璍曅歋漜擖緤噎瞱潱皣擛靥鄴曄嶪壄鎁澲謁餣嶫曗瞸擨鍱擫爗擪饁鎑礏鵺鐷靨驜蠮瓛鸈" };
			table[L"yi"] = { L"乁一乙乚乂义亿已弋刈以艺辷忆弌匇匜阣仡仪议肊衤伊伇亦芅彵迆夷异屹扡圯忔钇衣医劮冝佁佚译诒苡苅役呓吚宐尾壱抑沂坄杝杙攺矣耴邑依佾侇诣叕苢迤迱呹呭驿宜妷狋狏峄饴泄泆沶绎怡怿怈炈枍欥易祎秇疙衪俋荑迻奕弈庡帟帠咿咦姨峓拸洟洢浂恞贻轶柂枻昳瓵珆玴疫蚁羿舣釔食倚谊逘射弬唈宧挹浥浳巸垼悒扅扆栘栧桋栺欭胰益眙袘袣笖貤酏郼勚偯萓萟逸猗掜渏埸埶殹悘悥移铱痍異畩蛇翊翌豙豛訲訳釶釴隿羛鄓遗幆崺壹揖湙殔旑焬焲椅棭椬敧敡晹攲蛡蛜蛦貽軼詒詍跇鈘鈠鉯骮鳦羠亄義兿嗌媐獈溢缢煕椸暆禕意竩睪痬裿蛾肄詣誃跠飴頉颐裔裛勩叆蓺廙嫛嫕漪潩旖榏膉稦瘗疑蜴銥駅億儀遺嬄撎熠熤熪熼槸毅镒瘞鹝鹢箷篒輢誼黓彛劓儗薏彜噫嬑嬟嶧嶬夁澺墿圛懌憶殪燚敼曀穓瞖瘱鹥褹瑿螠螘螔縊艗頤頥寱寲嶷懝燡燱檥檍斁歝曎臆繄翳翼簃貖顊鴺鮨鮧彞藝藙彝檹毉镱癔礒贀謻醫鎰黟蟻繹繶艤豷鏔霬顗鶂鶃鯣蘙瀷籎轙譯議譩醷醳饐囈觺鐿鷊鷁懿讉鷖襼驛鷧黳齮虉鷾鸃讛齸" };
			table[L"yin"] = { L"廴冘引尹印囙乑阴阥岃因苂吟吲犾饮圻侌茚烎斦茵荫骃姻洇泿洕垠垔胤音陰荶狺峾垽圁栶氤欭殷珢蚓粌訚訔凐隐隂陻唫寅婬崟崯淫梀秵铟银硍裀訡赺喑婣湮湚堙堷愔猌淾絪筃龂鈏鈝飲鄞隠蔭蒑廕溵滛歅禋碒飮靷蔩夤慇朄瘖窨輑酳龈銦銀噖殥璌慭癊磤緸誾趛鞇隱檃憖憗瘾諲霒駰鮣噾嶾濥濦懚螾縯闉霠嚚檭檼蟫蘟霪齗櫽韾癮齦讔鷣" };
			table[L"ying"] = { L"夃迎应旲応盁英茔郢荧柍映盈矨偀莺莹浧桜珱眏耺萤营萦啨営婴媖渶绬愥桯梬蛍萾溁溋焸焽煐楧景暎瑛朠硬颍僌蓥媵嫈嵤滢塋楹碤颖颕嘤撄摬潆缨熒滎甇蝇蝧罂緓賏影樱潁璎膡禜瑩蝿噟嬴營穎瘿鹦螢罃縈褮霙鞕頴鴬藀嬰濙濚濴赢應膺覮謍韺瀅爃甖鹰蠅鎣巆攍瀛瀯瀠鶑鶧蘡廮嚶孆巊攖瀴孾櫿罌贏譍鐛灐櫻瓔礯譻鶯癭籝鑍灜蠳纓鷪鱦鷹鸎籯鸚" };
			table[L"yo"] = { L"哟唷喲" };
			table[L"yong"] = { L"永用佣甬咏泳拥怺苚俑栐勈勇痈砽柡悀邕埇涌恿庸揘湧硧蒏惥喁愑詠雍傭鄘蛹嗈愹嵱塎彮慵嫞墉慂踊滽鲬銿颙牗牅槦镛壅郺踴澭噰擁臃醟癕鯒顒雝鳙鏞灉鰫廱饔鷛鱅癰" };
			table[L"you"] = { L"又尢冘友尤右幼由甴优有丣卣邮佑苃妋犹汼沋忧攸酉侑呦狖油泑怞怮孧肬羑诱迶哊宥姷峟囿幽斿柚牰祐怣疣郵莜莸莠莤逌庮唀峳浟栯秞铀偤逰梎梄悠铕痏蚰蚴聈訧亴遊猶揂游湵釉貁鱿楢猷禉蜏酭鈾鲉麀羪滺輏誘銪駀蕕槱牖牗憂蝣魷輶鮋鄾優繇黝嚘獶瀀懮鼬櫌櫾耰纋獿" };
			table[L"yu"] = { L"丂与于亐予肀邘込驭玉邪伃伛芋芌迂迃吁宇屿扝扜纡圫羽聿余吾妤妪饫扵汩忬灹杅欤玙玗郁陓於欥育盂穻衧臾鱼雨俞俣俁兪语茟茰狱捓挧禺禹昱秗虶舁紆竽俼谀叞娱娪娛娯狳峪彧馀浴圄桙栯祤钰砡酑预匬隅鄅隃偊谕萸逳尉庾唹阈捥淤渔淯淢域堉圉惐敔欲悆盓痏粖翑釪雩魚袬萭萮御逾遇奥庽喻喅喩寓媮婾媀嵎嵛崳揄渝湡堣堬愉斞焴棫棛棜楰琟琙腴矞鹆硲硢畬裕粥飫骬馭傴蓣蒮奧寙滪煜觎榆楀楡牏歈瑜瑀愚愈稢瘀瘐罭虞與艅誉鈺預隩僪嫗獄嶎漁戫毓睮瘉窬褕蜮蜟舆緎箊輍語銉薁蓹蕍遹潏熨慾歶稶窳蝓豫諛龉鋊餘雓頨鳿魣羭蕷藇噳嬩嶼澦澞懙燠燏覦諭貐踰錥閾鴥鴪鴧儥歟璵鹬礇禦螸輿鍝魊斔穥癒礖礜篽謣醧麌鵒鮽旟櫲籅饇騟蘌蘛轝譽鐭霱鰅雤欎鬻驈鷠齬籞鷸鱊鸆鸒齵欝軉鬰鬱灪籲爩" };
			table[L"yuan"] = { L"元円夗邧贠芫远员妧沅园囦肙苑茒宛妴杬鸢剈院垣怨爰盶貟原冤弲員垸圆悁眢鸳蚖衏笎袁厡逺寃涴渊渁渆渕傆葾喛媛猨援掾湲淵缘圎惌鼋蒝蒬遠嫄媴猿源溒塬園圓楥棩禐瑗鹓裷蜎辕榞榬愿裫褑箢鳶褤蝯蜵蝝縁緣駌魭薳薗噮圜橼螈鋺鴛黿羱轅謜鎱邍嬽櫞願鵷灁騵鶢鶰鼘鼝厵" };
			table[L"yue"] = { L"曰月戉曱乐约扚刖兊兑礿兌抈岄妜岳玥泧枂钥哕約说恱栎钺蚏蚎軏悅悦哾阅啘跀跃捳越粤鈅鉞楽粵說説閱閲樂箹嬳噦樾髺篗龠臒嶽藥矱矆擽籆櫟黦蘥瀹爚躍禴趯籥鑰鸑籰鸙" };
			table[L"yun"] = { L"匀勻允云孕阭伝芸运夽员妘狁抎抣沄纭囩郓枟昀玧郧陨恽秐眃畇貟荺員涢涒晕耺耘紜鄆菀殒酝隕鄖傊蒀運喗媪缊愠惲鈗雲蒕蒷媼溳慍愪煴煇榅氲暈韫腪筠筼韵殞煾熅熉氳褞馻蕰蕴蕓奫澐熨磒蝹緼緷鋆薀赟橒縕縜篔賱醖醞餫藴霣鞰韞韗馧蘊贇韻齫齳" };

			table[L"za"] = { L"帀扎匝杂沞咂咋咱沯拶紥砸桚偺紮喒鉔韴雑噈魳襍雜臜囃囋囐臢雥" };
			table[L"zai"] = { L"仔在再扗災灾抂甾哉洅载宰烖栽畠菑渽傤崽溨載酨睵儎縡賳" };
			table[L"zan"] = { L"兂拶昝咱桚堑寁偺喒暂揝塹暫噆糌賛撍橵錾赞鄼儧篸濽鵤酂蹔簮簪攅瓉鏩鏨贊攒鐕瓒鐟酇儹讃灒攢囋趱瓚禶襸穳趲讚饡" };
			table[L"zang"] = { L"驵匨羘脏奘弉牂赃葬塟賍臧賘蔵銺駔藏臓臟贓髒贜" };
			table[L"zao"] = { L"早皁皂灶枣蚤造唣唕梍凿棗傮艁煰慥喿遭璅澡噪簉竃薻糟燥璪醩蹧藻竈躁趮譟鑿" };
			table[L"ze"] = L"仄庂汄则沢択昗侧昃责迮泎泽择則捑舴側責帻唶啧啫笮崱稄睪滜溭矠飵蔶箦幘嘖嫧樍歵赜諎澤瞔皟擇耫簀襗礋賾謮蠌灂齚齰鸅";
			table[L"zei"] = L"贼戝賊鲗蠈鰂鱡";
			table[L"zen"] = L"怎谮撍譖";
			table[L"zeng"] = L"综曽锃曾鄫綜増增缯鋥憎赠熷橧甑璔縡磳罾矰竲繒鬵贈譄囎鱛";
			table[L"zha"] = L"扎乍札吒厏诈灹怍抯拃闸咋苲軋栅查柞炸柤眨査挓咤奓痄砟宱紥哳铡蚱蚻剳紮偧揸喳喋喥詐溠渣鲊飵閘搾牐楂煠劄摣鲝潳箚榨皶觰諎霅樝鮓皻鍘醡耫鮺譇譗齄齇";
			table[L"zhai"] = L"厇宅厏抧择亝侧哜夈债捚斋窄側責斎砦祭鉙債寨摘榸翟擇瘵檡擿嚌齋";
			table[L"zhan"] = L"占佔怗沾斩枬飐战毡栈展站旃盏桟栴斬菚蛅飦粘绽偡崭惉棧琖湛嵁詀趈戦搌盞碊詹閚綻颭榐僝辗嶃嶄鳽谵醆嫸嶘橏霑薝邅噡虥虦戰嶦輾氈氊皽覱鹯瞻颤旜轏譧譫饘鳣欃蘸驏魙驙鸇鱣黵讝";
			table[L"zhang"] = L"丈仉仧仗扙兏杖帐弡张胀账涨張帳章涱脹掌痮傽障鄣粻漲慞漳蔁遧幛嫜獐嶂彰墇暲樟璋賬瞕瘴瘬餦礃鞝蟑騿麞鱆";
			table[L"zhao"] = L"爫爪召兆佋找钊诏妱招沼巶枛狣垗昭赵炤笊肁釗啅啁着菬棹旐釽詔朝鉊鳭瑵罩照肇肈箌趙嘲駋曌鍣鮡燳濯櫂瞾皽羄";
			table[L"zhe"] = L"乇厇这杔折扸矺者歽砓柘籷虴浙袩埑這粍哲着悊晣晢啠辄淛喆聑棏詟蛰蜇锗馲谪搩蔗摺嫬輒遮嗻慹銸踷赭輙樜磔鹧褶辙鍺蟄蟅螫鮿嚞謺謫轍讁鷓襵讋";
			table[L"zhei"] = L"这";
			table[L"zhen"] = L"阵圳贞诊纼针侦抮枕甽陣侲弫帧姫挋浈轸枮昣珍珎胗鸩貞帪屒振桢栚祯朕真眕眞疹砧畛袗紖針偵萙赈桭眹聄紾酙葴遉幀寊揕湞塦竧裖軫覙診蓁蒖嫃獉搸溱缜填斟椹楨禎甄絼鉁殝榛榐槙禛瑱瑧碪賑誫潧稹镇箴鋴震駗鴆薽澵樼縝縥臻錱轃鍼鎭鎮籈辴鬒黰鱵";
			table[L"zheng"] = L"丁氶凧正争抍证佂诤征爭糽郑姃怔政炡拯挣埩峥狰脀徎钲烝眐症聇铮睁埥崝掙掟猙崢証筝揁媜幁睜諍踭塣徰靕蒸鉦晸徴鄭綪錚箏愸憕撜徵篜整鬇鴊證癥鏳";
			table[L"zhi"] = L"之夂氏支止只汁卮阯凪劧芝芖执旨至伿识芷帋吱扺扻汦沚汥纸巵址坁忮志豸厔制郅侄茋迣帜帙呮妷拓抧治泜织坧垁质炙斦枝杫祇祉肢秇直知郦陟俧庢庤咫姪峙指挃洔洷恉轵栀枳栉柣祗祑胝胑秖秓砋衹衼值倁値徏娡狾捗淽贽轾桎栺晊祬挚脂歭秩疻疷袟蚔聀紙致釞隻乿剬偫菭徝猘掷淔埴執梽梔楖秲秷铚眰痔痓鸷畤窒职紩翐貭觗訨趾袠傂彘骘崻滞殖戠椥植犆智禃痣蛭絷臷臸軹跖黹廌寘搘搱滍禔瓡稙稚锧置絺綕筫輊酯跱雉徴摭摕滯潌墆墌榰瘈疐蜘聜製覟誌銍馶馽徵幟嬂摨潪熫槯摯漐慹憄膣稺質觯踯踬銴鋕鳷隲擳瀄旘樴璏膱緻駤鴙劕儨擿擲懥櫛穉螲縶鴲藢懫蟙職織贄蹠櫍瓆襧觶軄騭鯯礩豑鶨鼅蘵躑騺驇躓鷙鑕豒";
			table[L"zhong"] = L"夂中汷众仲伀彸狆妕妐忪刣炂泈祌忠终肿柊钟盅种衳衶茽重衷蚣蚛冢舯偅眾終衆鈡筗喠媑堹尰歱腫煄塚蔠幒蜙瘇種锺緟徸銿螤鴤諥踵穜鍾螽鼨斔蹱鐘籦";
			table[L"zhou"] = L"州纣舟肘伷诌周帚宙妯咒呪绉侜疛胄昼冑洲炿轴胕咮紂荮诪珘皱郮烐酎辀鸼矪粙晝淍掫婤菷徟週啁葤詋軸赒粥喌椆晭輈睭甃銂箒碡翢駎僽輖賙皺縐噣駲霌鵃骤繇嚋薵謅盩騆鯞籀籕譸籒驟";
			table[L"zhu"] = L"丶主术朮伫朱竹助劯住佇芧苎纻邾侏诛苧迬驻宔拄拀注坾贮杼竺茱茿壴洙炷炢柱柷祝殶笁陼诸莇逐烛株祩珠竚眝疰砫罜窋著逫帾猪渚秼铢硃袾蛀紵紸舳笜羜尌嵀属煮煑铸蛛絑筑貯軴註跓蓫瘃褚筯誅跦鉒飳馵蕏嗻潴墸槠敱敳蝫翥箸銖嘱澍濐橥樦豬諸鋳駐燝磩築篴篫駯麈麆燭斀瞩簗鴸鮢藸瀦櫡鼄櫫櫧蠋鯺躅屬蠩鱁鑄劚囑孎灟鸀爥斸欘曯矚蠾钃";
			table[L"zhua"] = L"爫爪抓挝撾檛膼簻髽";
			table[L"zhuai"] = L"拽睉跩";
			table[L"zhuan"] = L"专传灷转叀専恮孨砖耑專啭転蒃堟剸瑑腞鄟傳漙塼赚嫥僎僝颛篆磗膞撰馔甎瑼竱諯磚篹賺襈篿縳簨轉顓蟤譔饌籑囀鱄";
			table[L"zhuang"] = L"庄妆壮状庒妝壯狀荘壵娤桩奘莊焋梉湷粧装裝漴僮樁撞幢糚戆戅戇";
			table[L"zhui"] = L"坠沝隹追笍娷缀骓奞隊揣缒惴椎甀腏膇畷硾锥綴赘墜縋諈醊錣錐礈贅騅鵻鑆";
			table[L"zhun"] = L"屯圫迍宒忳旽肫窀准谆啍淳訰埻凖稕準綧諄衠";
			table[L"zhuo"] = L"圴犳彴汋灼叕茁卓妰拙浊炪斫丵烵捔浞捉酌桌诼倬剢棁梲着聉涿淖啄啅娺棳椓棹斱斮焯晫琢琸窡蓔硺罬窧禚槕斲撯擆墌鋜諑諁劅噣濁篧燋缴穛藋擢濯斵斀櫡謶镯鵫繳鐯蠗灂鐲鷟籗穱蠿籱";
			table[L"zi"] = L"子仔芓吇孖字自吱姊姉孜杍茊沝胏秄矷甾兹茈茲荢茡呲咨呰姿姕洓秭虸耔籽剚倳赀资栥牸恣畠玆紎笫谘菑崰淄渍缁梓秶眦眥赼釨鄑葘嗞啙嵫滋湽孳辎椔粢紫胾胔嗭滓孶禌锱資貲觜訾訿趑蓻漬榟稵镃緇緕龇鈭輜鼒薋澬輺諮趦錙鲻髭鍿鎡璾頾頿鶅鯔齍纃鰦齜";
			table[L"zong"] = L"从纵枞宗疭总昮倊倧從猔偬捴骔综惣腙棕葼焧惾堫搃揔揌嵕嵏猣碂蓗朡椶傯粽綜総緃稯嵸摠潀潈緵緫縂翪糉蝬踪潨踨熜熧樅燪縦瘲磫總鍐繌縱豵蹤鬃騌糭鬉鬷騣鯮鯼鑁";
			table[L"zou"] = L"赱邹走驺奏陬诹郰菆掫揍棸鄒棷楱搊媰緅箃諏鄹鲰黀鯫騶齱齺";
			table[L"zu"] = L"卆阻足诅卒怚组俎爼珇祖柤哫唨倅租崒族菹崪組椊葅詛稡蒩箤靻踤镞鎐鏃";
			table[L"zuan"] = L"钻揝鉆篹繤賺缵纂纉劗攥鑚躜纘籫躦鑽";
			table[L"zui"] = L"咀冣厜栬酔絊朘祽最晬辠觜罪睟稡槜酻嗺嶊蕞醉嘴嶵樶檇鋷錊噿檌濢璻蟕欈纗";
			table[L"zun"] = L"拵捘栫袸尊僔銌遵墫撙嶟噂樽罇繜瀳譐鐏鳟鷷鱒";
			table[L"zuo"] = L"左作坐阼佐苲怍岝咗岞侳柮柞昨祚胙唑座秨袏莋笮做捽唶葄酢葃琢蓙稓筰鈼飵撮諎嘬穝繓糳";


			//常用词组
			phrase_.insert(L"我们");
			phrase_.insert(L"开心");
		}

		std::vector<std::wstring> parse(std::wstring s) const
		{
			for (auto i = s.begin(); i < s.end();)
			{
				if (*i == L' ')
					i = s.erase(i);
				else
					++i;
			}

			std::size_t start = 0;

			std::vector<std::wstring> pinyins;

			while (start < s.size())
			{
				auto end = _m_parse(s, start);
				pinyins.emplace_back(s.c_str() + start, end - start);

				start = end;
			}
			return pinyins;
		}

		std::vector<candidate> make_candidate(const std::vector<std::wstring>& py) const
		{
			if (py.empty())
				return {};

			auto cnds = _m_match_candidates(py.front());
			std::vector<candidate> phrase_cnds;

			std::vector<std::wstring> matched_phrase;

			for (auto& phrase : phrase_)
			{
				if (phrase.size() < 2)
					continue;

				auto ch = phrase[0];

				for (auto& cd : cnds)
				{
					if ((cd.text.length() == 1) && (cd.text.front() == ch))
					{
						matched_phrase.push_back(phrase);
					}
				}
			}

			if (!matched_phrase.empty())
			{
				std::wstring cnd_pinyin = py.front();
				std::vector<std::wstring> phrase_base;

				for (std::size_t i = 1; i < py.size(); ++i)
				{
					cnd_pinyin += ' ';
					cnd_pinyin += py[i];

					auto part_cnds = _m_match_candidates(py[i]);

					phrase_base = std::move(matched_phrase);

					for (auto& phrase : phrase_base)
					{
						auto ch = phrase[i];
						for (auto& cd : part_cnds)
						{
							if ((cd.text.length() == 1) && (cd.text.front() == ch))
							{
								if (phrase.size() > i + 1)
								{
									// 词的长度大于当前个数，则匹配这个词，并继续向后匹配
									matched_phrase.push_back(phrase);
								}
								else if (phrase.size() == i + 1)
								{
									auto& pcd = phrase_cnds.emplace_back();
									pcd.text = phrase;
									pcd.count = i + 1;
									pcd.pinyin = cnd_pinyin;
								}
							}
						}
					}

				}


				cnds.insert(cnds.cbegin(), phrase_cnds.cbegin(), phrase_cnds.cend());
			}

			return cnds;
		}
	private:
		std::vector<candidate> _m_match_candidates(const std::wstring& py) const
		{
			if (py.empty())
				return {};

			std::vector<candidate> cnds;
			std::vector<candidate> cnds_partial_first;
			std::vector<candidate> cnds_partial;

			//Scan the matches
			for (auto& m : table_)
			{
				auto pos = m.first.find(py);
				if (0 == pos)
				{
					if (m.first.size() == py.size())
					{
						for (auto& c : m.second)
						{
							auto& cd = cnds.emplace_back();
							cd.text = c;
							cd.count = 1;
							cd.pinyin = py;
						}
					}
					else
					{
						for (auto& c : m.second)
						{
							auto& cd = cnds_partial_first.emplace_back();
							cd.text = c;
							cd.count = 1;
							cd.pinyin = py;
						}
					}
				}
			}

			std::move(cnds_partial_first.begin(), cnds_partial_first.end(), std::back_inserter(cnds));

			std::move(cnds_partial.begin(), cnds_partial.end(), std::back_inserter(cnds));

			return cnds;
		}

		std::size_t _m_parse(const std::wstring& s, std::size_t start) const
		{
			auto pos = start;

			std::vector<std::wstring> matched;

			for (auto& m : table_)
			{
				if (m.first.npos == m.first.find(s[pos]))
					continue;

				matched.push_back(m.first);
			}

			while (++pos < s.size())
			{
				auto candidates = matched;

				auto piece = s.substr(start, pos - start + 1);
				for (auto i = candidates.cbegin(); i != candidates.cend(); )
				{
					if ((piece.size() > i->size()) || (std::wstring::npos == i->find(piece)))
					{
						i = candidates.erase(i);
						continue;
					}

					++i;
				}

				if (candidates.empty())
					return pos;

				matched.swap(candidates);
			}

			return pos;
		}
	private:
		std::map<std::wstring, std::wstring> table_;
		std::set<std::wstring> phrase_;
	};

	class im_pinyin :
		public im_interface
	{
		bool has_intermediate_input() const override
		{
			return !(intermediate_input_pinyin_.empty() && intermediate_input_picked_.empty());
		}

		std::wstring label(labels l) const override
		{
			switch (l)
			{
			case labels::name:
				return L"拼音";
			case labels::alphabet:
				return L"aoe";
			case labels::space:
				return L"空格";
			case labels::done:
				return L"完成";
			default:
				break;
			}
			return {};
		}

		std::string lang() const
		{
			return "zh-CN";
		}

		std::wstring input(std::size_t pos, wchar_t ch) override
		{
			if ('\b' == ch)
			{
				if (intermediate_input_picked_.empty() && intermediate_input_pinyin_.empty())
					return { &ch, 1 };

				if (pos > 0)
				{
					if (pos <= intermediate_input_picked_.size())
						intermediate_input_picked_.erase(pos - 1, 1);
					else
					{
						pos -= intermediate_input_picked_.size() + 1;
						while (pos > 0 && L' ' == intermediate_input_pinyin_[pos])
							intermediate_input_pinyin_.erase(pos--);

						intermediate_input_pinyin_.erase(pos, 1);
					}
				}
			}
			else
			{
				//If a whitespace is input, it should check intermediate_input_picked_ and intermediate_input_pinyin_ if they are empty.
				//If they are empty, it returns a space. Because the intermediate input always drops the space.
				if (' ' == ch && intermediate_input_picked_.empty() && intermediate_input_pinyin_.empty())
					return { &ch, 1 };

				if (pos >= intermediate_input_picked_.size())
					intermediate_input_pinyin_.insert(pos - intermediate_input_picked_.size(), 1, ch);
			}

			_m_parse_candidates();

			return intermediate_input_picked_ + intermediate_input_pinyin_;
		}

		std::vector<std::wstring> candidates() const override
		{
			std::vector<std::wstring> cds;
			for (auto& cd : candidates_)
				cds.push_back(cd.text);

			return cds;
		}

		std::wstring pick_candidate(std::size_t idx) override
		{
			intermediate_input_picked_ += candidates_[idx].text;
			intermediate_input_pinyin_.erase(0, candidates_[idx].pinyin.size());

			_m_parse_candidates();

			if (intermediate_input_pinyin_.empty())
			{
				auto ret = intermediate_input_picked_;

				intermediate_input_picked_.clear();

				this->candidates_.clear();

				return ret;
			}

			return intermediate_input_picked_ + intermediate_input_pinyin_;

		}

		std::wstring letters(bool lower) const override
		{
			return lower ? L"qwertyuiopasdfghjklzxcvbnm" : L"QWERTYUIOPASDFGHJKLZXCVBNM";
		}

		std::wstring digital_symbols(bool digital) const override
		{
			return digital ? L"-/:;()$&@\".,?!|'" : L"[]{}#%^*+=_—\\|~<>€￡￥·.,?!'";
		}

		std::vector<int> layout(bool /*letter*/) const override
		{
			return std::vector<int>{10, 9, 7};
		}
	private:
		void _m_parse_candidates()
		{
			auto cand_slice = pinyin_.parse(intermediate_input_pinyin_);

			std::wstring ret;
			if (!cand_slice.empty())
			{
				for (auto& cs : cand_slice)
				{
					ret += cs;
					ret += L' ';
				}

				candidates_ = pinyin_.make_candidate(cand_slice);
			}

			intermediate_input_pinyin_ = ret;
		}
	private:
		std::wstring intermediate_input_picked_;
		std::wstring intermediate_input_pinyin_;
		std::vector<pinyin::candidate> candidates_;
		pinyin pinyin_;
	};
}

#endif